[Killed] ArrayDeclaration
main/components/Jobs/JobsTable.jsx:8:30
 import { useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-const CANCELLABLE_STATUSES = ["queued", "running"];
+const CANCELLABLE_STATUSES = [];
 
 export default function JobsTable({ jobs, onCancelled = () => {} }) {
killedBy: JobsTable tests shows a Cancel button for a queued job
statusReason: Unable to find an element by: [data-testid="JobsTable-cell-row-0-col-cancel-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="JobsTable"

[Killed] StringLiteral
main/components/Jobs/JobsTable.jsx:8:31
 import { useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-const CANCELLABLE_STATUSES = ["queued", "running"];
+const CANCELLABLE_STATUSES = ["", "running"];
 
 export default function JobsTable({ jobs, onCancelled = () => {} }) {
killedBy: JobsTable tests shows a Cancel button for a queued job
statusReason: Unable to find an element by: [data-testid="JobsTable-cell-row-0-col-cancel-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="JobsTable"

[Killed] ArrowFunction
main/components/Jobs/JobsTable.jsx:11:35
 const CANCELLABLE_STATUSES = ["queued", "running"];
 
 export default function JobsTable({ jobs, onCancelled = () => {} }) {
-  const cellToAxiosParamsCancel = (cell) => ({
-    url: `/api/jobs/${cell.row.original.id}/cancel`,
-    method: "POST",
-  });
+  const cellToAxiosParamsCancel = () => undefined;
 
   const cancelSuccess = () => {
killedBy: JobsTable tests clicking Cancel requests cancellation and calls onCancelled
statusReason: expected +0 to deeply equal 1

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] StringLiteral
main/components/Jobs/JobsTable.jsx:12:10
 
 export default function JobsTable({ jobs, onCancelled = () => {} }) {
   const cellToAxiosParamsCancel = (cell) => ({
-    url: `/api/jobs/${cell.row.original.id}/cancel`,
+    url: ``,
     method: "POST",
   });
killedBy: JobsTable tests clicking Cancel requests cancellation and calls onCancelled
statusReason: expected "vi.fn()" to be called with arguments: [ 'Cancellation requested.' ]

Received:

  1st vi.fn() call:

  [
-   "Cancellation requested.",

[Killed] BlockStatement
main/components/Jobs/JobsTable.jsx:16:31
     method: "POST",
   });
 
-  const cancelSuccess = () => {
-    toast("Cancellation requested.");
-    onCancelled();
-  };
+  const cancelSuccess = () => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: JobsTable tests clicking Cancel requests cancellation and calls onCancelled
statusReason: expected "vi.fn()" to be called with arguments: [ 'Cancellation requested.' ]

Number of calls: 0

[Killed] StringLiteral
main/components/Jobs/JobsTable.jsx:17:11
   });
 
   const cancelSuccess = () => {
-    toast("Cancellation requested.");
+    toast("");
     onCancelled();
   };
killedBy: JobsTable tests clicking Cancel requests cancellation and calls onCancelled
statusReason: expected "vi.fn()" to be called with arguments: [ 'Cancellation requested.' ]

Received:

  1st vi.fn() call:

  [
-   "Cancellation requested.",

[Killed] BlockStatement
main/components/Jobs/JobsTable.jsx:27:36
   });
   // Stryker restore all
 
-  const cancelCallback = (cell) => {
-    cancelMutation.mutate(cell);
-  };
+  const cancelCallback = (cell) => {};
 
   const columns = [
killedBy: JobsTable tests clicking Cancel requests cancellation and calls onCancelled
statusReason: expected +0 to deeply equal 1

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] ObjectLiteral
main/components/Jobs/JobsTable.jsx:32:5
   };
 
   const columns = [
-    {
-      header: "id",
-      accessorKey: "id",
-    },
+    {},
     {
       header: "Job Name",
killedBy: JobsTable tests renders without crashing for empty table
statusReason: Columns require an id when using a non-string header

[Killed] ObjectLiteral
main/components/Jobs/JobsTable.jsx:36:5
       header: "id",
       accessorKey: "id",
     },
-    {
-      header: "Job Name",
-      accessorKey: "jobName",
-    },
+    {},
     {
       header: "User Email",
killedBy: JobsTable tests renders without crashing for empty table
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Jobs/JobsTable.jsx:38:20
     },
     {
       header: "Job Name",
-      accessorKey: "jobName",
+      accessorKey: "",
     },
     {
killedBy: JobsTable tests renders without crashing for empty table
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Jobs/JobsTable.jsx:41:15
       accessorKey: "jobName",
     },
     {
-      header: "User Email",
+      header: "",
       accessorKey: "createdByEmail",
     },
killedBy: JobsTable tests renders correctly with jobs data
statusReason: Unable to find an element with the text: User Email. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="JobsTable"

[Killed] ObjectLiteral
main/components/Jobs/JobsTable.jsx:44:5
       header: "User Email",
       accessorKey: "createdByEmail",
     },
-    {
-      header: "Scope",
-      accessorFn: (row) =>
-        row.scopeType ? `${row.scopeType}:${row.scopeId}` : "",
-      id: "scope",
-    },
+    {},
     {
       header: "Created",
killedBy: JobsTable tests renders without crashing for empty table
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Jobs/JobsTable.jsx:45:15
       accessorKey: "createdByEmail",
     },
     {
-      header: "Scope",
+      header: "",
       accessorFn: (row) =>
         row.scopeType ? `${row.scopeType}:${row.scopeId}` : "",
killedBy: JobsTable tests renders correctly with jobs data
statusReason: Unable to find an element with the text: Scope. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="JobsTable"

[Killed] ArrowFunction
main/components/Jobs/JobsTable.jsx:46:19
     },
     {
       header: "Scope",
-      accessorFn: (row) =>
-        row.scopeType ? `${row.scopeType}:${row.scopeId}` : "",
+      accessorFn: () => undefined,
       id: "scope",
     },
killedBy: JobsTable tests renders correctly with jobs data
statusReason: Unable to find an element with the text: course:101. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="JobsTable"

[Killed] StringLiteral
main/components/Jobs/JobsTable.jsx:47:61
     {
       header: "Scope",
       accessorFn: (row) =>
-        row.scopeType ? `${row.scopeType}:${row.scopeId}` : "",
+        row.scopeType ? `${row.scopeType}:${row.scopeId}` : "Stryker was here!",
       id: "scope",
     },
killedBy: JobsTable tests renders empty string for Scope when the job is unscoped
statusReason: expect(element).toBeEmptyDOMElement()

Received:
  "Stryker was here!"

[Killed] ObjectLiteral
main/components/Jobs/JobsTable.jsx:50:5
         row.scopeType ? `${row.scopeType}:${row.scopeId}` : "",
       id: "scope",
     },
-    {
-      header: "Created",
-      accessorFn: (row) => formatTime(row.createdAt),
-      id: "createdAt",
-    },
+    {},
     {
       header: "Updated",
killedBy: JobsTable tests renders without crashing for empty table
statusReason: Columns require an id when using a non-string header

[Killed] ArrowFunction
main/components/Jobs/JobsTable.jsx:52:19
     },
     {
       header: "Created",
-      accessorFn: (row) => formatTime(row.createdAt),
+      accessorFn: () => undefined,
       id: "createdAt",
     },
killedBy: JobsTable tests renders correctly with jobs data
statusReason: Unable to find an element with the text: 2023-01-01 10:05:00. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="JobsTable"

[Killed] StringLiteral
main/components/Jobs/JobsTable.jsx:56:15
       id: "createdAt",
     },
     {
-      header: "Updated",
+      header: "",
       accessorFn: (row) => formatTime(row.updatedAt),
       id: "updatedAt",
killedBy: JobsTable tests renders correctly with jobs data
statusReason: Unable to find an element with the text: Updated. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="JobsTable"

[Killed] ArrowFunction
main/components/Jobs/JobsTable.jsx:57:19
     },
     {
       header: "Updated",
-      accessorFn: (row) => formatTime(row.updatedAt),
+      accessorFn: () => undefined,
       id: "updatedAt",
     },
killedBy: JobsTable tests renders correctly with jobs data
statusReason: Unable to find an element with the text: 2023-01-01 10:05:00. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="JobsTable"

[Killed] ArrowFunction
main/components/Jobs/JobsTable.jsx:67:13
     {
       header: "Cancel",
       id: "cancel",
-      cell: ({ cell }) =>
-        CANCELLABLE_STATUSES.includes(cell.row.original.status) ? (
-          <Button
-            variant="danger"
-            size="sm"
-            onClick={() => cancelCallback(cell)}
-            data-testid={`JobsTable-cell-row-${cell.row.index}-col-cancel-button`}
-          >
-            Cancel
-          </Button>
-        ) : null,
+      cell: () => undefined,
     },
     {
killedBy: JobsTable tests shows a Cancel button for a queued job
statusReason: Unable to find an element by: [data-testid="JobsTable-cell-row-0-col-cancel-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="JobsTable"

[Killed] ArrowFunction
main/components/Jobs/JobsTable.jsx:72:22
           <Button
             variant="danger"
             size="sm"
-            onClick={() => cancelCallback(cell)}
+            onClick={() => undefined}
             data-testid={`JobsTable-cell-row-${cell.row.index}-col-cancel-button`}
           >
killedBy: JobsTable tests clicking Cancel requests cancellation and calls onCancelled
statusReason: expected +0 to deeply equal 1

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] ArrowFunction
main/components/Jobs/JobsTable.jsx:82:13
     {
       header: "Log",
       accessorKey: "log",
-      cell: ({ cell }) => (
-        <div
-          style={{ maxWidth: 450, maxHeight: 100, overflowY: "auto" }}
-          data-testid={`JobsTable-cell-row-${cell.row.index}-col-${cell.column.id}-div`}
-        >
-          <pre style={{ whiteSpace: "pre-wrap" }}>{cell.getValue()}</pre>
-        </div>
-      ),
+      cell: () => undefined,
     },
   ];
killedBy: JobsTable tests renders correctly with jobs data
statusReason: Unable to find an element with the text: Job completed successfully. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="JobsTable"

[Killed] ObjectLiteral
main/components/Jobs/JobsTable.jsx:87:23
           style={{ maxWidth: 450, maxHeight: 100, overflowY: "auto" }}
           data-testid={`JobsTable-cell-row-${cell.row.index}-col-${cell.column.id}-div`}
         >
-          <pre style={{ whiteSpace: "pre-wrap" }}>{cell.getValue()}</pre>
+          <pre style={{}}>{cell.getValue()}</pre>
         </div>
       ),
killedBy: JobsTable tests renders correctly with jobs data
statusReason: expect(element).toHaveStyle()

- Expected

- whiteSpace: pre-wrap;
