[Killed] ArrowFunction
main/pages/Admin/AdminJobsPage.jsx:11:43
 import { useBackendMutation } from "main/utils/useBackend";
 
 export default function AdminJobsPage() {
-  const objectToAxiosParamsUpdateAllJob = () => ({
-    url: "/api/jobs/launch/updateAll",
-    method: "POST",
-  });
+  const objectToAxiosParamsUpdateAllJob = () => undefined;
 
   const updateAllJobMutation = useBackendMutation(
killedBy: AdminJobsPage tests clicking Update All Users button calls the correct API
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
main/pages/Admin/AdminJobsPage.jsx:11:50
 import { useBackendMutation } from "main/utils/useBackend";
 
 export default function AdminJobsPage() {
-  const objectToAxiosParamsUpdateAllJob = () => ({
-    url: "/api/jobs/launch/updateAll",
-    method: "POST",
-  });
+  const objectToAxiosParamsUpdateAllJob = () => ({});
 
   const updateAllJobMutation = useBackendMutation(
killedBy: AdminJobsPage tests clicking Update All Users button calls the correct API
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/pages/Admin/AdminJobsPage.jsx:22:42
     ["/api/jobs/all"],
   );
 
-  const submitUpdateAllJob = async () => {
-    updateAllJobMutation.mutate();
-  };
+  const submitUpdateAllJob = async () => {};
 
   // purge job
killedBy: AdminJobsPage tests clicking Update All Users button calls the correct API
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArrowFunction
main/pages/Admin/AdminJobsPage.jsx:27:42
   };
 
   // purge job
-  const objectToAxiosParamsPurgeJobLog = () => ({
-    url: "/api/jobs/all",
-    method: "DELETE",
-  });
+  const objectToAxiosParamsPurgeJobLog = () => undefined;
 
   const purgeJobLogMutation = useBackendMutation(
killedBy: AdminJobsPage tests clicking Purge Job Log button calls the correct API
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/pages/Admin/AdminJobsPage.jsx:38:35
     ["/api/jobs/all"],
   );
 
-  const purgeJobLog = async () => {
-    purgeJobLogMutation.mutate();
-  };
+  const purgeJobLog = async () => {};
 
   const { data: jobs, refetch } = useBackend(
killedBy: AdminJobsPage tests clicking Purge Job Log button calls the correct API
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArrayDeclaration
main/pages/Admin/AdminJobsPage.jsx:43:5
   };
 
   const { data: jobs, refetch } = useBackend(
-    ["/api/jobs/all"],
+    [],
     {
       //Stryker disable next-line StringLiteral: axios default is GET
killedBy: AdminJobsPage tests renders without crashing
statusReason: expected undefined to deeply equal []

[Killed] ObjectLiteral
main/pages/Admin/AdminJobsPage.jsx:44:5
 
   const { data: jobs, refetch } = useBackend(
     ["/api/jobs/all"],
-    {
-      //Stryker disable next-line StringLiteral: axios default is GET
-      method: "GET",
-      url: "/api/jobs/all",
-    },
+    {},
     [],
   );
killedBy: AdminJobsPage tests renders job table with data
statusReason: Unable to find an element with the text: complete. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ArrayDeclaration
main/pages/Admin/AdminJobsPage.jsx:52:24
     [],
   );
 
-  const jobLaunchers = [
-    {
-      name: "Update All Users",
-      form: (
-        <SingleButtonJobForm
-          callback={submitUpdateAllJob}
-          text={"Start"}
-          testid={"updateAllJob"}
-        />
-      ),
-    },
-  ];
+  const jobLaunchers = [];
 
   return (
killedBy: AdminJobsPage tests renders job launchers correctly
statusReason: Unable to find an element with the text: Update All Users. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ObjectLiteral
main/pages/Admin/AdminJobsPage.jsx:53:5
   );
 
   const jobLaunchers = [
-    {
-      name: "Update All Users",
-      form: (
-        <SingleButtonJobForm
-          callback={submitUpdateAllJob}
-          text={"Start"}
-          testid={"updateAllJob"}
-        />
-      ),
-    },
+    {},
   ];
 
killedBy: AdminJobsPage tests renders job launchers correctly
statusReason: Unable to find an element with the text: Update All Users. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] StringLiteral
main/pages/Admin/AdminJobsPage.jsx:54:13
 
   const jobLaunchers = [
     {
-      name: "Update All Users",
+      name: "",
       form: (
         <SingleButtonJobForm
killedBy: AdminJobsPage tests renders job launchers correctly
statusReason: Unable to find an element with the text: Update All Users. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"
