[Killed] ArrowFunction
main/pages/Admin/AdminJobsPage.jsx:11:38
 import { useBackendMutation } from "main/utils/useBackend";
 
 export default function AdminJobsPage() {
-  const objectToAxiosParamsTestJob = () => ({
-    url: "/api/jobs/launch/testjob",
-    method: "POST",
-  });
+  const objectToAxiosParamsTestJob = () => undefined;
 
   const testJobMutation = useBackendMutation(objectToAxiosParamsTestJob, {}, [
killedBy: AdminJobsPage tests clicking the Test Job button calls the correct API
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
main/pages/Admin/AdminJobsPage.jsx:11:45
 import { useBackendMutation } from "main/utils/useBackend";
 
 export default function AdminJobsPage() {
-  const objectToAxiosParamsTestJob = () => ({
-    url: "/api/jobs/launch/testjob",
-    method: "POST",
-  });
+  const objectToAxiosParamsTestJob = () => ({});
 
   const testJobMutation = useBackendMutation(objectToAxiosParamsTestJob, {}, [
killedBy: AdminJobsPage tests clicking the Test Job button calls the correct API
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArrayDeclaration
main/pages/Admin/AdminJobsPage.jsx:16:78
     method: "POST",
   });
 
-  const testJobMutation = useBackendMutation(objectToAxiosParamsTestJob, {}, [
-    "/api/jobs/all",
-  ]);
+  const testJobMutation = useBackendMutation(objectToAxiosParamsTestJob, {}, []);
 
   const submitTestJob = async () => {
killedBy: AdminJobsPage tests clicking the Test Job button calls the correct API
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
main/pages/Admin/AdminJobsPage.jsx:20:37
     "/api/jobs/all",
   ]);
 
-  const submitTestJob = async () => {
-    testJobMutation.mutate();
-  };
+  const submitTestJob = async () => {};
 
   // purge job
killedBy: AdminJobsPage tests clicking the Test Job button calls the correct API
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArrayDeclaration
main/pages/Admin/AdminJobsPage.jsx:33:5
   const purgeJobLogMutation = useBackendMutation(
     objectToAxiosParamsPurgeJobLog,
     {},
-    ["/api/jobs/all"],
+    [],
   );
 
killedBy: AdminJobsPage tests clicking Purge Job Log button calls the correct API
statusReason: expected +0 to be 1 // Object.is equality

[Killed] StringLiteral
main/pages/Admin/AdminJobsPage.jsx:41:6
   };
 
   const { data: jobs, refetch } = useBackend(
-    ["/api/jobs/all"],
+    [""],
     {
       //Stryker disable next-line StringLiteral: axios default is GET
killedBy: AdminJobsPage tests renders without crashing
statusReason: expected undefined to deeply equal []

[Killed] StringLiteral
main/pages/Admin/AdminJobsPage.jsx:45:12
     {
       //Stryker disable next-line StringLiteral: axios default is GET
       method: "GET",
-      url: "/api/jobs/all",
+      url: "",
     },
     [],
killedBy: AdminJobsPage tests renders job table with data
statusReason: Unable to find an element with the text: complete. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"
