[Killed] BlockStatement
main/components/Jobs/SingleButtonJobForm.jsx:3:73
 import { Button } from "react-bootstrap";
 
-export default function SingleButtonJobForm({ callback, text, testid }) {
-  return (
-    <Button onClick={callback} data-testid={`${testid}-job-submit`}>
-      {text}
-    </Button>
-  );
-}
+export default function SingleButtonJobForm({ callback, text, testid }) {}
 
killedBy: AdminJobsPage tests clicking Update All Users button calls the correct API
statusReason: Unable to find an element by: [data-testid="updateAllJob-job-submit"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"
