[Killed] BooleanLiteral
main/pages/Admin/RecruitmentCoursesPage.tsx:17:56
 
   // Removed courses are hidden by default; the toggle is for operations and debugging, to see
   // what an earlier Populate left out.
-  const [includeRemoved, setIncludeRemoved] = useState(false);
+  const [includeRemoved, setIncludeRemoved] = useState(true);
 
   const { data: courses } = useBackend<RecruitmentCourse[]>(
killedBy: RecruitmentCoursesPage tests removed courses are hidden by default
statusReason: expected <td …(2)><span …(1)></span></td> to be null

[Killed] StringLiteral
main/pages/Admin/RecruitmentCoursesPage.tsx:23:12
     ["/api/recruitmentcourses/all", includeRemoved],
     {
       method: "GET",
-      url: "/api/recruitmentcourses/all",
+      url: "",
       params: { recruitmentId, includeRemoved },
     },
killedBy: RecruitmentCoursesPage tests lists the recruitment's courses
statusReason: Unable to find an element by: [data-testid="RecruitmentCoursesPage-cell-row-0-col-courseId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ArrowFunction
main/pages/Admin/RecruitmentCoursesPage.tsx:31:5
   );
 
   const populateMutation = useBackendMutation<void, unknown>(
-    () => ({
-      url: "/api/jobs/launch/populateRecruitmentCourses",
-      method: "POST",
-      params: { recruitmentId },
-    }),
+    () => undefined,
     {
       onSuccess: () =>
killedBy: RecruitmentCoursesPage tests Populate launches the job and points at the Jobs page
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
main/pages/Admin/RecruitmentCoursesPage.tsx:31:12
   );
 
   const populateMutation = useBackendMutation<void, unknown>(
-    () => ({
-      url: "/api/jobs/launch/populateRecruitmentCourses",
-      method: "POST",
-      params: { recruitmentId },
-    }),
+    () => ({}),
     {
       onSuccess: () =>
killedBy: RecruitmentCoursesPage tests Populate launches the job and points at the Jobs page
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/pages/Admin/RecruitmentCoursesPage.tsx:32:12
 
   const populateMutation = useBackendMutation<void, unknown>(
     () => ({
-      url: "/api/jobs/launch/populateRecruitmentCourses",
+      url: "",
       method: "POST",
       params: { recruitmentId },
killedBy: RecruitmentCoursesPage tests Populate launches the job and points at the Jobs page
statusReason: expected 'Error: Request failed with status cod…' to match /Jobs/

[Killed] ArrowFunction
main/pages/Admin/RecruitmentCoursesPage.tsx:37:18
       params: { recruitmentId },
     }),
     {
-      onSuccess: () =>
-        toast(
-          "Populate job started. Watch its progress on the Admin > Jobs page.",
-        ),
+      onSuccess: () => undefined,
     },
     ["/api/recruitmentcourses/all", includeRemoved],
killedBy: RecruitmentCoursesPage tests Populate launches the job and points at the Jobs page
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Survived] ArrayDeclaration
main/pages/Admin/RecruitmentCoursesPage.tsx:42:5
           "Populate job started. Watch its progress on the Admin > Jobs page.",
         ),
     },
-    ["/api/recruitmentcourses/all", includeRemoved],
+    [],
   );
 

[Killed] ArrowFunction
main/pages/Admin/RecruitmentCoursesPage.tsx:58:22
 
         <div className="d-flex align-items-center gap-3 mb-3">
           <Button
-            onClick={() => populateMutation.mutate()}
+            onClick={() => undefined}
             data-testid="RecruitmentCoursesPage-populate"
           >
killedBy: RecruitmentCoursesPage tests Populate launches the job and points at the Jobs page
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BooleanLiteral
main/pages/Admin/RecruitmentCoursesPage.tsx:68:47
             id="RecruitmentCoursesPage-show-removed"
             label="Show removed courses"
             checked={includeRemoved}
-            onChange={() => setIncludeRemoved(!includeRemoved)}
+            onChange={() => setIncludeRemoved(includeRemoved)}
             data-testid="RecruitmentCoursesPage-show-removed"
           />
killedBy: RecruitmentCoursesPage tests the toggle asks the backend for removed courses too
statusReason: Unable to find an element by: [data-testid="RecruitmentCoursesPage-cell-row-3-col-removed-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ArrowFunction
main/pages/Admin/RecruitmentCoursesPage.tsx:68:23
             id="RecruitmentCoursesPage-show-removed"
             label="Show removed courses"
             checked={includeRemoved}
-            onChange={() => setIncludeRemoved(!includeRemoved)}
+            onChange={() => undefined}
             data-testid="RecruitmentCoursesPage-show-removed"
           />
killedBy: RecruitmentCoursesPage tests the toggle asks the backend for removed courses too
statusReason: Unable to find an element by: [data-testid="RecruitmentCoursesPage-cell-row-3-col-removed-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] LogicalOperator
main/pages/Admin/RecruitmentCoursesPage.tsx:74:20
         </div>
 
         <RecruitmentCourseTable
-          courses={courses ?? []}
+          courses={courses && []}
           includeRemoved={includeRemoved}
           testIdPrefix="RecruitmentCoursesPage"
killedBy: RecruitmentCoursesPage tests lists the recruitment's courses
statusReason: Unable to find an element by: [data-testid="RecruitmentCoursesPage-cell-row-0-col-courseId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[NoCoverage] ArrayDeclaration
main/pages/Admin/RecruitmentCoursesPage.tsx:74:31
         </div>
 
         <RecruitmentCourseTable
-          courses={courses ?? []}
+          courses={courses ?? ["Stryker was here"]}
           includeRemoved={includeRemoved}
           testIdPrefix="RecruitmentCoursesPage"
