[Killed] BlockStatement
main/pages/Help/AboutTaApply.jsx:3:40
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function AboutTaApply() {
-  return (
-    <BasicLayout>
-      <h1>About TA Apply</h1>
-
-      <p>
-        TA Apply is a UCSB CS project. This application shell was built from{" "}
-        <a href="https://github.com/ucsb-cs156/proj-scaffold">proj-scaffold</a>,
-        and provides Google sign-in, Admin/Instructor role management, a
-        background jobs subsystem, and a Developer page.
-      </p>
-    </BasicLayout>
-  );
-}
+export default function AboutTaApply() {}
 
killedBy: AboutTaApply tests renders expected content
statusReason: Unable to find role="heading" and name "About TA Apply"

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Survived] StringLiteral
main/pages/Help/AboutTaApply.jsx:9:78
       <h1>About TA Apply</h1>
 
       <p>
-        TA Apply is a UCSB CS project. This application shell was built from{" "}
+        TA Apply is a UCSB CS project. This application shell was built from{""}
         <a href="https://github.com/ucsb-cs156/proj-scaffold">proj-scaffold</a>,
         and provides Google sign-in, Admin/Instructor role management, a
