[Killed] OptionalChaining
main/pages/Home/HomePageLoggedIn.jsx:18:21
       <div className="pt-2">
         <h1>TA Apply</h1>
         <p data-testid="HomePageLoggedIn-greeting">
-          Welcome, {currentUser.root?.user?.givenName ?? "Gaucho"}.
+          Welcome, {currentUser.root.user?.givenName ?? "Gaucho"}.
         </p>
 
killedBy: HomePageLoggedIn tests greets the user by given name
statusReason: Cannot read properties of null (reading 'user')

[Killed] LogicalOperator
main/pages/Home/HomePageLoggedIn.jsx:18:21
       <div className="pt-2">
         <h1>TA Apply</h1>
         <p data-testid="HomePageLoggedIn-greeting">
-          Welcome, {currentUser.root?.user?.givenName ?? "Gaucho"}.
+          Welcome, {currentUser.root?.user?.givenName && "Gaucho"}.
         </p>
 
killedBy: HomePageLoggedIn tests greets the user by given name
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Welcome, Gaucho.
Received:
  Welcome, .

[Killed] LogicalOperator
main/pages/Home/HomePageLoggedIn.jsx:21:10
           Welcome, {currentUser.root?.user?.givenName ?? "Gaucho"}.
         </p>
 
-        {isAdmin && (
-          <p data-testid="HomePageLoggedIn-admin">
-            You are an admin. Use the Admin menu to manage instructors and grad
-            students.
-          </p>
-        )}
+        {isAdmin || <p data-testid="HomePageLoggedIn-admin">
+            You are an admin. Use the Admin menu to manage instructors and grad
+            students.
+          </p>}
         {isInstructor && (
           <p data-testid="HomePageLoggedIn-instructor">
killedBy: HomePageLoggedIn tests a plain user sees only the ULA message
statusReason: expected <p …(1)></p> to be null

[Killed] ConditionalExpression
main/pages/Home/HomePageLoggedIn.jsx:21:10
           Welcome, {currentUser.root?.user?.givenName ?? "Gaucho"}.
         </p>
 
-        {isAdmin && (
-          <p data-testid="HomePageLoggedIn-admin">
-            You are an admin. Use the Admin menu to manage instructors and grad
-            students.
-          </p>
-        )}
+        {true}
         {isInstructor && (
           <p data-testid="HomePageLoggedIn-instructor">
killedBy: HomePageLoggedIn tests an admin sees the admin message but is not treated as a grad student
statusReason: Unable to find an element by: [data-testid="HomePageLoggedIn-admin"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ConditionalExpression
main/pages/Home/HomePageLoggedIn.jsx:27:10
             students.
           </p>
         )}
-        {isInstructor && (
-          <p data-testid="HomePageLoggedIn-instructor">
-            You are an instructor.
-          </p>
-        )}
+        {true}
         {isGradStudent && (
           <p data-testid="HomePageLoggedIn-gradstudent">
killedBy: HomePageLoggedIn tests an instructor sees the instructor message
statusReason: Unable to find an element by: [data-testid="HomePageLoggedIn-instructor"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] LogicalOperator
main/pages/Home/HomePageLoggedIn.jsx:27:10
             students.
           </p>
         )}
-        {isInstructor && (
-          <p data-testid="HomePageLoggedIn-instructor">
-            You are an instructor.
-          </p>
-        )}
+        {isInstructor || <p data-testid="HomePageLoggedIn-instructor">
+            You are an instructor.
+          </p>}
         {isGradStudent && (
           <p data-testid="HomePageLoggedIn-gradstudent">
killedBy: HomePageLoggedIn tests a plain user sees only the ULA message
statusReason: expected <p …(1)></p> to be null

[Killed] ConditionalExpression
main/pages/Home/HomePageLoggedIn.jsx:32:10
             You are an instructor.
           </p>
         )}
-        {isGradStudent && (
-          <p data-testid="HomePageLoggedIn-gradstudent">
-            You are a grad student, so you will be able to apply for TA
-            positions once applications open.
-          </p>
-        )}
+        {true}
         {!isGradStudent && (
           <p data-testid="HomePageLoggedIn-undergrad">
killedBy: HomePageLoggedIn tests a grad student sees the TA message and not the ULA message
statusReason: Unable to find an element by: [data-testid="HomePageLoggedIn-gradstudent"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] LogicalOperator
main/pages/Home/HomePageLoggedIn.jsx:32:10
             You are an instructor.
           </p>
         )}
-        {isGradStudent && (
-          <p data-testid="HomePageLoggedIn-gradstudent">
-            You are a grad student, so you will be able to apply for TA
-            positions once applications open.
-          </p>
-        )}
+        {isGradStudent || <p data-testid="HomePageLoggedIn-gradstudent">
+            You are a grad student, so you will be able to apply for TA
+            positions once applications open.
+          </p>}
         {!isGradStudent && (
           <p data-testid="HomePageLoggedIn-undergrad">
killedBy: HomePageLoggedIn tests a plain user sees only the ULA message
statusReason: expected <p …(1)></p> to be null

[Killed] LogicalOperator
main/pages/Home/HomePageLoggedIn.jsx:38:10
             positions once applications open.
           </p>
         )}
-        {!isGradStudent && (
-          <p data-testid="HomePageLoggedIn-undergrad">
-            You will be able to apply for ULA positions once applications open.
-          </p>
-        )}
+        {!isGradStudent || <p data-testid="HomePageLoggedIn-undergrad">
+            You will be able to apply for ULA positions once applications open.
+          </p>}
       </div>
     </BasicLayout>
killedBy: HomePageLoggedIn tests a plain user sees only the ULA message
statusReason: Unable to find an element by: [data-testid="HomePageLoggedIn-undergrad"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ConditionalExpression
main/pages/Home/HomePageLoggedIn.jsx:38:10
             positions once applications open.
           </p>
         )}
-        {!isGradStudent && (
-          <p data-testid="HomePageLoggedIn-undergrad">
-            You will be able to apply for ULA positions once applications open.
-          </p>
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: HomePageLoggedIn tests a plain user sees only the ULA message
statusReason: Unable to find an element by: [data-testid="HomePageLoggedIn-undergrad"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"
