[Killed] ConditionalExpression
main/pages/Admin/RecruitmentsIndexPage.tsx:20:18
 
   // Stryker disable OptionalChaining
   const startQtr = systemInfo?.startQtrYYYYQ || "20211";
-  const endQtr = systemInfo?.endQtrYYYYQ || "20254";
+  const endQtr = true;
   // Stryker restore OptionalChaining
 
killedBy: RecruitmentsIndexPage tests renders the heading and the recruitments
statusReason: param should be a string

[Killed] ConditionalExpression
main/pages/Admin/RecruitmentsIndexPage.tsx:20:18
 
   // Stryker disable OptionalChaining
   const startQtr = systemInfo?.startQtrYYYYQ || "20211";
-  const endQtr = systemInfo?.endQtrYYYYQ || "20254";
+  const endQtr = false;
   // Stryker restore OptionalChaining
 
killedBy: RecruitmentsIndexPage tests renders the heading and the recruitments
statusReason: param should be a string

[Killed] ArrowFunction
main/pages/Admin/RecruitmentsIndexPage.tsx:35:5
   const [pendingDelete, setPendingDelete] = useState<Recruitment | null>(null);
 
   const createMutation = useBackendMutation<RecruitmentFormFields, Recruitment>(
-    (data) => ({
-      url: "/api/admin/recruitments/post",
-      method: "POST",
-      params: data,
-    }),
+    () => undefined,
     {
       onSuccess: () =>
killedBy: RecruitmentsIndexPage tests creating a recruitment posts the form and toasts
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/pages/Admin/RecruitmentsIndexPage.tsx:36:12
 
   const createMutation = useBackendMutation<RecruitmentFormFields, Recruitment>(
     (data) => ({
-      url: "/api/admin/recruitments/post",
+      url: "",
       method: "POST",
       params: data,
killedBy: RecruitmentsIndexPage tests creating a recruitment posts the form and toasts
statusReason: expected 'Error: Request failed with status cod…' to match /Recruitment created/

[Killed] ObjectLiteral
main/pages/Admin/RecruitmentsIndexPage.tsx:40:5
       method: "POST",
       params: data,
     }),
-    {
-      onSuccess: () =>
-        toast(
-          "Recruitment created. Its course list is being filled; watch the Admin > Jobs page.",
-        ),
-    },
+    {},
     ["/api/admin/recruitments/all"],
   );
killedBy: RecruitmentsIndexPage tests creating a recruitment posts the form and toasts
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArrowFunction
main/pages/Admin/RecruitmentsIndexPage.tsx:41:18
       params: data,
     }),
     {
-      onSuccess: () =>
-        toast(
-          "Recruitment created. Its course list is being filled; watch the Admin > Jobs page.",
-        ),
+      onSuccess: () => undefined,
     },
     ["/api/admin/recruitments/all"],
killedBy: RecruitmentsIndexPage tests creating a recruitment posts the form and toasts
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArrowFunction
main/pages/Admin/RecruitmentsIndexPage.tsx:50:5
   );
 
   const deleteMutation = useBackendMutation<Recruitment, unknown>(
-    (recruitment) => ({
-      url: "/api/admin/recruitments/delete",
-      method: "DELETE",
-      params: { id: recruitment.id },
-    }),
+    () => undefined,
     { onSuccess: () => setPendingDelete(null) },
     ["/api/admin/recruitments/all"],
killedBy: RecruitmentsIndexPage tests confirming the modal deletes that recruitment
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] StringLiteral
main/pages/Admin/RecruitmentsIndexPage.tsx:52:15
   const deleteMutation = useBackendMutation<Recruitment, unknown>(
     (recruitment) => ({
       url: "/api/admin/recruitments/delete",
-      method: "DELETE",
+      method: "",
       params: { id: recruitment.id },
     }),
killedBy: RecruitmentsIndexPage tests confirming the modal deletes that recruitment
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Survived] ObjectLiteral
main/pages/Admin/RecruitmentsIndexPage.tsx:55:5
       method: "DELETE",
       params: { id: recruitment.id },
     }),
-    { onSuccess: () => setPendingDelete(null) },
+    {},
     ["/api/admin/recruitments/all"],
   );

[Survived] StringLiteral
main/pages/Admin/RecruitmentsIndexPage.tsx:56:6
       params: { id: recruitment.id },
     }),
     { onSuccess: () => setPendingDelete(null) },
-    ["/api/admin/recruitments/all"],
+    [""],
   );
 

[Killed] ArrowFunction
main/pages/Admin/RecruitmentsIndexPage.tsx:71:25
 
         <RecruitmentForm
           quarters={quarters}
-          submitAction={(data) => createMutation.mutate(data)}
+          submitAction={() => undefined}
         />
 
killedBy: RecruitmentsIndexPage tests creating a recruitment posts the form and toasts
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] LogicalOperator
main/pages/Admin/RecruitmentsIndexPage.tsx:77:25
         <hr />
 
         <RecruitmentTable
-          recruitments={recruitments ?? []}
+          recruitments={recruitments && []}
           onDeleteRequested={setPendingDelete}
           testIdPrefix="RecruitmentsIndexPage"
killedBy: RecruitmentsIndexPage tests renders the heading and the recruitments
statusReason: Unable to find an element by: [data-testid="RecruitmentsIndexPage-cell-row-0-col-quarter"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ArrowFunction
main/pages/Admin/RecruitmentsIndexPage.tsx:84:22
 
         <RecruitmentDeleteModal
           recruitment={pendingDelete}
-          onConfirm={() => deleteMutation.mutate(pendingDelete as Recruitment)}
+          onConfirm={() => undefined}
           onCancel={() => setPendingDelete(null)}
         />
killedBy: RecruitmentsIndexPage tests confirming the modal deletes that recruitment
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ArrowFunction
main/pages/Admin/RecruitmentsIndexPage.tsx:85:21
         <RecruitmentDeleteModal
           recruitment={pendingDelete}
           onConfirm={() => deleteMutation.mutate(pendingDelete as Recruitment)}
-          onCancel={() => setPendingDelete(null)}
+          onCancel={() => undefined}
         />
       </div>
killedBy: RecruitmentsIndexPage tests cancelling the modal deletes nothing
statusReason: expected <button type="button" …(2)></button> to be null

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""
