[Killed] BlockStatement
src/main/utils/dateUtils.js:6:39
  * @param {string} timestamp - ISO format timestamp string
  * @returns {string} - Formatted date and time string
  */
-export function formatTime(timestamp) {
-  if (!timestamp) {
-    return "";
-  }
-
-  const date = new Date(timestamp);
-  return date.toLocaleString();
-}
+export function formatTime(timestamp) {}
 
killedBy: dateUtils tests formatTime formats a valid timestamp correctly
statusReason: expected undefined to be '1/1/2023, 4:30:45 AM' // Object.is equality

[Killed] ConditionalExpression
src/main/utils/dateUtils.js:7:7
  * @returns {string} - Formatted date and time string
  */
 export function formatTime(timestamp) {
-  if (!timestamp) {
+  if (true) {
     return "";
   }
killedBy: dateUtils tests formatTime formats a valid timestamp correctly
statusReason: expected '' to be '1/1/2023, 4:30:45 AM' // Object.is equality

[Killed] BlockStatement
src/main/utils/dateUtils.js:7:19
  * @returns {string} - Formatted date and time string
  */
 export function formatTime(timestamp) {
-  if (!timestamp) {
-    return "";
-  }
+  if (!timestamp) {}
 
   const date = new Date(timestamp);
killedBy: dateUtils tests formatTime returns empty string for null timestamp
statusReason: expected '12/31/1969, 4:00:00 PM' to be '' // Object.is equality

[Killed] StringLiteral
src/main/utils/dateUtils.js:8:12
  */
 export function formatTime(timestamp) {
   if (!timestamp) {
-    return "";
+    return "Stryker was here!";
   }
 
killedBy: dateUtils tests formatTime returns empty string for null timestamp
statusReason: expected 'Stryker was here!' to be '' // Object.is equality
