[Killed] StringLiteral
main/components/Auth/LoginScreen.tsx:59:12
             whiteSpace: "pre-line",
           }}
         >
-          {"Welcome to\nTA Apply"}
+          {""}
         </div>
         <div
killedBy: LoginScreen renders the TA Apply branding, prompt, and login button
statusReason: Unable to find an element with the text: Welcome to TA Apply. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      style="width: 100%; height: 100%; display: flex; align-items: center; justify-content: center; backgrou

[Survived] StringLiteral
main/components/Auth/LoginScreen.tsx:64:20
         <div
           style={{
             fontSize: 14,
-            color: "#64748B",
+            color: "",
             marginBottom: 28,
             marginTop: 20,

[Survived] StringLiteral
main/components/Auth/LoginScreen.tsx:80:21
             fontWeight: 600,
             background: "#1E293B",
             color: "#fff",
-            border: "none",
+            border: "",
             borderRadius: 8,
             cursor: "pointer",
