[Killed] StringLiteral
main/components/Levels/SingleLevelDropdown.jsx:10:11
   controlId,
   level = "",
   onChange = null,
-  label = "Course Level",
+  label = "",
 }) => {
   const localSearchLevel = localStorage.getItem(controlId);
killedBy: CoursesIndexPage tests renders the two quarter dropdowns and the level dropdown
statusReason: Unable to find a label with the text of: Course Level

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] BlockStatement
main/components/Levels/SingleLevelDropdown.jsx:20:42
     level || localSearchLevel || "U",
   );
 
-  const handleLeveltoChange = (event) => {
-    localStorage.setItem(controlId, event.target.value);
-    setLevelState(event.target.value);
-    setLevel(event.target.value);
-    if (onChange != null) {
-      onChange(event);
-    }
-  };
+  const handleLeveltoChange = (event) => {};
 
   return (
killedBy: CoursesIndexPage tests Populate posts the selected range and level
statusReason: expected { startQuarter: '20212', …(2) } to deeply equal { startQuarter: '20212', …(2) }

[Killed] BlockStatement
main/components/Levels/SingleLevelDropdown.jsx:24:27
     localStorage.setItem(controlId, event.target.value);
     setLevelState(event.target.value);
     setLevel(event.target.value);
-    if (onChange != null) {
-      onChange(event);
-    }
+    if (onChange != null) {}
   };
 
killedBy: SingleLevelDropdown tests if I pass a non-null onChange, it gets called when the value changes
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div>

[Killed] ConditionalExpression
main/components/Levels/SingleLevelDropdown.jsx:24:9
     localStorage.setItem(controlId, event.target.value);
     setLevelState(event.target.value);
     setLevel(event.target.value);
-    if (onChange != null) {
+    if (false) {
       onChange(event);
     }
killedBy: SingleLevelDropdown tests if I pass a non-null onChange, it gets called when the value changes
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div>

[Killed] BlockStatement
main/components/Levels/SingleLevelDropdown.jsx:37:42
         value={levelState}
         onChange={handleLeveltoChange}
       >
-        {levels.map(function (object, i) {
-          const key = `${controlId}-option-${i}`;
-          return (
-            <option key={key} data-testid={key} value={object[0]}>
-              {object[1]}
-            </option>
-          );
-        })}
+        {levels.map(function (object, i) {})}
       </Form.Control>
     </Form.Group>
killedBy: SingleLevelDropdown tests when I select an level, the value changes
statusReason: Value "U" not found in options

Ignored nodes: comments, script, style
<select
  class="form-control"
  id="sld1"
/>

[Killed] StringLiteral
main/components/Levels/SingleLevelDropdown.jsx:38:23
         onChange={handleLeveltoChange}
       >
         {levels.map(function (object, i) {
-          const key = `${controlId}-option-${i}`;
+          const key = ``;
           return (
             <option key={key} data-testid={key} value={object[0]}>
killedBy: SingleLevelDropdown tests keys / testids are set correctly on options
statusReason: Unable to find an element by: [data-testid="sld1-option-0"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <label
        class="form-label"
