[Killed] StringLiteral
main/components/Nav/AppNavbar.tsx:55:37
                   <Nav.Link href="/h2-console">H2Console</Nav.Link>
                 </>
               )}
-              {hasRole(currentUser, "ROLE_ADMIN") && (
+              {hasRole(currentUser, "") && (
                 <NavDropdown
                   title="Admin"
killedBy: AppNavbar tests renders Admin menu for admins
statusReason: Unable to find an element with the text: Admin. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-sm navbar-light bg-warning sticky-top"
      data-testid="AppNavbarLocalhost"
