[Survived] BooleanLiteral
main/components/Quarters/SingleQuarterDropdown.jsx:26:13
   controlId,
   onChange = null,
   label = "Quarter",
-  showAll = false,
+  showAll = true,
 }) {
   const lastInd = quarters.length - 1;

[Killed] ArithmeticOperator
main/components/Quarters/SingleQuarterDropdown.jsx:28:19
   label = "Quarter",
   showAll = false,
 }) {
-  const lastInd = quarters.length - 1;
+  const lastInd = quarters.length + 1;
 
   const localSearchQuarter = localStorage.getItem(controlId);
killedBy: SingleQuarterSelector tests renders without crashing on one quarter
statusReason: Cannot read properties of undefined (reading 'yyyyq')

[Killed] BooleanLiteral
main/components/Quarters/SingleQuarterDropdown.jsx:32:7
 
   const localSearchQuarter = localStorage.getItem(controlId);
 
-  if (!localSearchQuarter) {
+  if (localSearchQuarter) {
     localStorage.setItem(controlId, quarters[lastInd].yyyyq);
   }
killedBy: SingleQuarterSelector tests when localstorage has no value, last element of quarter range is the default parameter
statusReason: expected "setItem" to be called with arguments: [ 'sqd1', '20224' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
main/components/Quarters/SingleQuarterDropdown.jsx:32:7
 
   const localSearchQuarter = localStorage.getItem(controlId);
 
-  if (!localSearchQuarter) {
+  if (false) {
     localStorage.setItem(controlId, quarters[lastInd].yyyyq);
   }
killedBy: SingleQuarterSelector tests when localstorage has no value, last element of quarter range is the default parameter
statusReason: expected "setItem" to be called with arguments: [ 'sqd1', '20224' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
main/components/Quarters/SingleQuarterDropdown.jsx:60:10
         value={quarterState}
         onChange={handleQuarterOnChange}
       >
-        {showAll && (
-          <option data-testid={`${controlId}-option-all`} value="ALL">
-            ALL
-          </option>
-        )}
+        {false}
         {quarters.map(function (object, i) {
           const key = `${controlId}-option-${i}`;
killedBy: SingleQuarterSelector tests renders "ALL" option when showAll is true
statusReason: Unable to find an element by: [data-testid="sqd1-option-all"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <label
        class="form-label"

[Killed] ConditionalExpression
main/components/Quarters/SingleQuarterDropdown.jsx:60:10
         value={quarterState}
         onChange={handleQuarterOnChange}
       >
-        {showAll && (
-          <option data-testid={`${controlId}-option-all`} value="ALL">
-            ALL
-          </option>
-        )}
+        {true}
         {quarters.map(function (object, i) {
           const key = `${controlId}-option-${i}`;
killedBy: SingleQuarterSelector tests renders "ALL" option when showAll is true
statusReason: Unable to find an element by: [data-testid="sqd1-option-all"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <label
        class="form-label"

[Killed] BlockStatement
main/components/Quarters/SingleQuarterDropdown.jsx:65:44
             ALL
           </option>
         )}
-        {quarters.map(function (object, i) {
-          const key = `${controlId}-option-${i}`;
-          return (
-            <option key={key} data-testid={key} value={object.yyyyq}>
-              {object.qyy}
-            </option>
-          );
-        })}
+        {quarters.map(function (object, i) {})}
       </Form.Control>
     </Form.Group>
killedBy: SingleQuarterSelector tests renders "ALL" option when showAll is true
statusReason: Unable to find an element by: [data-testid="sqd1-option-0"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <label
        class="form-label"

[Killed] StringLiteral
main/components/Quarters/SingleQuarterDropdown.jsx:66:23
           </option>
         )}
         {quarters.map(function (object, i) {
-          const key = `${controlId}-option-${i}`;
+          const key = ``;
           return (
             <option key={key} data-testid={key} value={object.yyyyq}>
killedBy: SingleQuarterSelector tests renders "ALL" option when showAll is true
statusReason: Unable to find an element by: [data-testid="sqd1-option-0"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <label
        class="form-label"
