[Killed] ArrayDeclaration
main/pages/Admin/AdminUsersPage.tsx:18:12
 const pageSizeOptions = [10, 25, 50, 100, 500];
 
 const emptyUsersPage: UsersPage = {
-  content: [],
+  content: ["Stryker was here"],
   number: 0,
   size: 10,
killedBy: AdminUsersPage tests useBackend is called with correct cache query key
statusReason: expected "useBackend" to be called with arguments: [ Array(3) ]

Received:

  1st useBackend call:

@@ -11,11 +11,13 @@
        "size": 10,

[Killed] ArrayDeclaration
main/pages/Admin/AdminUsersPage.tsx:30:5
   const [pageSize, setPageSize] = useState(10);
 
   const { data: usersPage } = useBackend<UsersPage>(
-    ["/api/admin/users", page, pageSize],
+    [],
     {
       method: "GET",
killedBy: AdminUsersPage tests supports paging and changing page size
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Page 2 of 2
Received:
  Page 1 of 2

Ignored nodes: comments, script, style

[Killed] LogicalOperator
main/pages/Admin/AdminUsersPage.tsx:39:31
     emptyUsersPage,
   );
 
-  const totalPages = Math.max(usersPage?.totalPages ?? 0, 1);
+  const totalPages = Math.max(usersPage?.totalPages && 0, 1);
   const currentPage = (usersPage?.number ?? 0) + 1;
 
killedBy: AdminUsersPage tests supports paging and changing page size
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Page 2 of 2
Received:
  Page 2 of 1

Ignored nodes: comments, script, style

[Killed] MethodExpression
main/pages/Admin/AdminUsersPage.tsx:39:22
     emptyUsersPage,
   );
 
-  const totalPages = Math.max(usersPage?.totalPages ?? 0, 1);
+  const totalPages = Math.min(usersPage?.totalPages ?? 0, 1);
   const currentPage = (usersPage?.number ?? 0) + 1;
 
killedBy: AdminUsersPage tests supports paging and changing page size
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Page 2 of 2
Received:
  Page 2 of 1

Ignored nodes: comments, script, style

[Killed] ArithmeticOperator
main/pages/Admin/AdminUsersPage.tsx:40:23
   );
 
   const totalPages = Math.max(usersPage?.totalPages ?? 0, 1);
-  const currentPage = (usersPage?.number ?? 0) + 1;
+  const currentPage = (usersPage?.number ?? 0) - 1;
 
   return (
killedBy: AdminUsersPage tests renders paged users with controls
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Page 1 of 1
Received:
  Page -1 of 1

[Killed] LogicalOperator
main/pages/Admin/AdminUsersPage.tsx:40:24
   );
 
   const totalPages = Math.max(usersPage?.totalPages ?? 0, 1);
-  const currentPage = (usersPage?.number ?? 0) + 1;
+  const currentPage = (usersPage?.number && 0) + 1;
 
   return (
killedBy: AdminUsersPage tests supports paging and changing page size
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Page 2 of 2
Received:
  Page 1 of 2

Ignored nodes: comments, script, style

[Killed] BlockStatement
main/pages/Admin/AdminUsersPage.tsx:51:36
             <Form.Label>Page size</Form.Label>
             <Form.Select
               value={pageSize}
-              onChange={(event) => {
-                setPageSize(Number(event.target.value));
-                setPage(0);
-              }}
+              onChange={(event) => {}}
             >
               {pageSizeOptions.map((sizeOption) => (
killedBy: AdminUsersPage tests supports paging and changing page size
statusReason: Unable to find an element by: [data-testid="UsersTable-cell-row-1-col-email"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ArrowFunction
main/pages/Admin/AdminUsersPage.tsx:56:36
                 setPage(0);
               }}
             >
-              {pageSizeOptions.map((sizeOption) => (
-                <option key={sizeOption} value={sizeOption}>
-                  {sizeOption}
-                </option>
-              ))}
+              {pageSizeOptions.map(() => undefined)}
             </Form.Select>
           </Form.Group>
killedBy: AdminUsersPage tests renders paged users with controls
statusReason: expect(element).toHaveValue(10)

Expected the element to have value:
  10
Received:
  undefined

[Survived] ArrowFunction
main/pages/Admin/AdminUsersPage.tsx:66:24
           <div className="d-flex align-items-center gap-2">
             <Button
               variant="secondary"
-              onClick={() =>
-                setPage((previousPage) => Math.max(previousPage - 1, 0))
+              onClick={() => undefined
               }
               disabled={page === 0}

[NoCoverage] ArithmeticOperator
main/pages/Admin/AdminUsersPage.tsx:67:52
             <Button
               variant="secondary"
               onClick={() =>
-                setPage((previousPage) => Math.max(previousPage - 1, 0))
+                setPage((previousPage) => Math.max(previousPage + 1, 0))
               }
               disabled={page === 0}

[NoCoverage] MethodExpression
main/pages/Admin/AdminUsersPage.tsx:67:43
             <Button
               variant="secondary"
               onClick={() =>
-                setPage((previousPage) => Math.max(previousPage - 1, 0))
+                setPage((previousPage) => Math.min(previousPage - 1, 0))
               }
               disabled={page === 0}

[Killed] ConditionalExpression
main/pages/Admin/AdminUsersPage.tsx:69:25
               onClick={() =>
                 setPage((previousPage) => Math.max(previousPage - 1, 0))
               }
-              disabled={page === 0}
+              disabled={false}
             >
               Previous
killedBy: AdminUsersPage tests renders paged users with controls
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <button
  class="btn btn-secondary"
  type="button"
/>

[Killed] EqualityOperator
main/pages/Admin/AdminUsersPage.tsx:69:25
               onClick={() =>
                 setPage((previousPage) => Math.max(previousPage - 1, 0))
               }
-              disabled={page === 0}
+              disabled={page !== 0}
             >
               Previous
killedBy: AdminUsersPage tests renders paged users with controls
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <button
  class="btn btn-secondary"
  type="button"
/>

[Killed] ArrowFunction
main/pages/Admin/AdminUsersPage.tsx:78:24
             </span>
             <Button
               variant="secondary"
-              onClick={() => setPage((previousPage) => previousPage + 1)}
+              onClick={() => undefined}
               disabled={page + 1 >= (usersPage?.totalPages ?? 0)}
             >
killedBy: AdminUsersPage tests supports paging and changing page size
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Page 2 of 2
Received:
  Page 1 of 2

Ignored nodes: comments, script, style

[Survived] ArrowFunction
main/pages/Admin/AdminUsersPage.tsx:78:38
             </span>
             <Button
               variant="secondary"
-              onClick={() => setPage((previousPage) => previousPage + 1)}
+              onClick={() => setPage(() => undefined)}
               disabled={page + 1 >= (usersPage?.totalPages ?? 0)}
             >

[Killed] ConditionalExpression
main/pages/Admin/AdminUsersPage.tsx:79:25
             <Button
               variant="secondary"
               onClick={() => setPage((previousPage) => previousPage + 1)}
-              disabled={page + 1 >= (usersPage?.totalPages ?? 0)}
+              disabled={true}
             >
               Next
killedBy: AdminUsersPage tests supports paging and changing page size
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Page 2 of 2
Received:
  Page 1 of 2

Ignored nodes: comments, script, style

[Killed] EqualityOperator
main/pages/Admin/AdminUsersPage.tsx:79:25
             <Button
               variant="secondary"
               onClick={() => setPage((previousPage) => previousPage + 1)}
-              disabled={page + 1 >= (usersPage?.totalPages ?? 0)}
+              disabled={page + 1 > (usersPage?.totalPages ?? 0)}
             >
               Next
killedBy: AdminUsersPage tests renders paged users with controls
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <button
  class="btn btn-secondary"
  type="button"
/>

[Killed] LogicalOperator
main/pages/Admin/AdminUsersPage.tsx:85:28
             </Button>
           </div>
         </div>
-        <UsersTable users={usersPage?.content ?? []} />
+        <UsersTable users={usersPage?.content && []} />
       </div>
     </BasicLayout>
killedBy: AdminUsersPage tests renders paged users with controls
statusReason: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-email"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Survived] OptionalChaining
main/pages/Admin/AdminUsersPage.tsx:85:28
             </Button>
           </div>
         </div>
-        <UsersTable users={usersPage?.content ?? []} />
+        <UsersTable users={usersPage.content ?? []} />
       </div>
     </BasicLayout>
