[Killed] LogicalOperator
main/pages/Admin/CoursesIndexPage.tsx:32:18
 
   // Stryker disable OptionalChaining
   const startQtr = systemInfo?.startQtrYYYYQ || "20211";
-  const endQtr = systemInfo?.endQtrYYYYQ || "20254";
+  const endQtr = systemInfo?.endQtrYYYYQ && "20254";
   const subjectArea = systemInfo?.subjectArea || "CMPSC";
   // Stryker restore OptionalChaining
killedBy: CoursesIndexPage tests renders the heading, the configured subject area, and the courses
statusReason: param should be a string

[Killed] LogicalOperator
main/pages/Admin/CoursesIndexPage.tsx:33:23
   // Stryker disable OptionalChaining
   const startQtr = systemInfo?.startQtrYYYYQ || "20211";
   const endQtr = systemInfo?.endQtrYYYYQ || "20254";
-  const subjectArea = systemInfo?.subjectArea || "CMPSC";
+  const subjectArea = systemInfo?.subjectArea && "CMPSC";
   // Stryker restore OptionalChaining
 
killedBy: CoursesIndexPage tests falls back to defaults when systemInfo has no quarter bounds
statusReason: Unable to find an element with the text: CMPSC. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ConditionalExpression
main/pages/Admin/CoursesIndexPage.tsx:33:23
   // Stryker disable OptionalChaining
   const startQtr = systemInfo?.startQtrYYYYQ || "20211";
   const endQtr = systemInfo?.endQtrYYYYQ || "20254";
-  const subjectArea = systemInfo?.subjectArea || "CMPSC";
+  const subjectArea = true;
   // Stryker restore OptionalChaining
 
killedBy: CoursesIndexPage tests renders the heading, the configured subject area, and the courses
statusReason: Unable to find an element with the text: CMPSC. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ArithmeticOperator
main/pages/Admin/CoursesIndexPage.tsx:40:14
 
   const [startQuarter, setStartQuarter] = useState(quarters[0].yyyyq);
   const [endQuarter, setEndQuarter] = useState(
-    quarters[quarters.length - 1].yyyyq,
+    quarters[quarters.length + 1].yyyyq,
   );
   const [level, setLevel] = useState("U");
killedBy: CoursesIndexPage tests renders the heading, the configured subject area, and the courses
statusReason: Cannot read properties of undefined (reading 'yyyyq')

[Survived] StringLiteral
main/pages/Admin/CoursesIndexPage.tsx:45:6
   const [level, setLevel] = useState("U");
 
   const { data: courses } = useBackend<Course[]>(
-    ["/api/courses/all"],
+    [""],
     { method: "GET", url: "/api/courses/all" },
     // Stryker disable next-line all : don't test default value of empty list

[Survived] ArrayDeclaration
main/pages/Admin/CoursesIndexPage.tsx:45:5
   const [level, setLevel] = useState("U");
 
   const { data: courses } = useBackend<Course[]>(
-    ["/api/courses/all"],
+    [],
     { method: "GET", url: "/api/courses/all" },
     // Stryker disable next-line all : don't test default value of empty list

[Killed] ArrowFunction
main/pages/Admin/CoursesIndexPage.tsx:51:31
     [],
   );
 
-  const objectToAxiosParams = (params: PopulateParams): AxiosRequestConfig => ({
-    url: "/api/jobs/launch/populateCourses",
-    method: "POST",
-    params,
-  });
+  const objectToAxiosParams = () => undefined;
 
   const populateMutation = useBackendMutation<PopulateParams, unknown>(
killedBy: CoursesIndexPage tests Populate posts the selected range and level
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/pages/Admin/CoursesIndexPage.tsx:53:13
 
   const objectToAxiosParams = (params: PopulateParams): AxiosRequestConfig => ({
     url: "/api/jobs/launch/populateCourses",
-    method: "POST",
+    method: "",
     params,
   });
killedBy: CoursesIndexPage tests Populate posts the selected range and level
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/pages/Admin/CoursesIndexPage.tsx:60:24
   const populateMutation = useBackendMutation<PopulateParams, unknown>(
     objectToAxiosParams,
     {
-      onSuccess: () => {
-        toast(
-          "Populate job started. Watch its progress on the Admin > Jobs page.",
-        );
-      },
+      onSuccess: () => {},
     },
     ["/api/courses/all"],
killedBy: CoursesIndexPage tests a successful Populate points the admin at the Jobs page
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/pages/Admin/CoursesIndexPage.tsx:62:11
     {
       onSuccess: () => {
         toast(
-          "Populate job started. Watch its progress on the Admin > Jobs page.",
+          "",
         );
       },
killedBy: CoursesIndexPage tests a successful Populate points the admin at the Jobs page
statusReason: expected '' to match /Populate job started/

[Survived] ArrayDeclaration
main/pages/Admin/CoursesIndexPage.tsx:66:5
         );
       },
     },
-    ["/api/courses/all"],
+    [],
   );
 

[Survived] StringLiteral
main/pages/Admin/CoursesIndexPage.tsx:66:6
         );
       },
     },
-    ["/api/courses/all"],
+    [""],
   );
 

[Killed] BlockStatement
main/pages/Admin/CoursesIndexPage.tsx:69:28
     ["/api/courses/all"],
   );
 
-  const onPopulate = () => {
-    if (toNumericYYYYQ(startQuarter) > toNumericYYYYQ(endQuarter)) {
-      toast("Start quarter must not be after end quarter.");
-      return;
-    }
-    populateMutation.mutate({ startQuarter, endQuarter, level });
-  };
+  const onPopulate = () => {};
 
   return (
killedBy: CoursesIndexPage tests Populate posts the selected range and level
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ConditionalExpression
main/pages/Admin/CoursesIndexPage.tsx:70:9
   );
 
   const onPopulate = () => {
-    if (toNumericYYYYQ(startQuarter) > toNumericYYYYQ(endQuarter)) {
+    if (false) {
       toast("Start quarter must not be after end quarter.");
       return;
killedBy: CoursesIndexPage tests a backwards range is rejected client-side and posts nothing
statusReason: expected 'Populate job started. Watch its progr…' to match /Start quarter must not be after end q…/

[Killed] EqualityOperator
main/pages/Admin/CoursesIndexPage.tsx:70:9
   );
 
   const onPopulate = () => {
-    if (toNumericYYYYQ(startQuarter) > toNumericYYYYQ(endQuarter)) {
+    if (toNumericYYYYQ(startQuarter) <= toNumericYYYYQ(endQuarter)) {
       toast("Start quarter must not be after end quarter.");
       return;
killedBy: CoursesIndexPage tests Populate posts the selected range and level
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/pages/Admin/CoursesIndexPage.tsx:71:13
 
   const onPopulate = () => {
     if (toNumericYYYYQ(startQuarter) > toNumericYYYYQ(endQuarter)) {
-      toast("Start quarter must not be after end quarter.");
+      toast("");
       return;
     }
killedBy: CoursesIndexPage tests a backwards range is rejected client-side and posts nothing
statusReason: expected '' to match /Start quarter must not be after end q…/

[Killed] BlockStatement
main/pages/Admin/CoursesIndexPage.tsx:89:28
         </p>
 
         <Form
-          onSubmit={(e) => {
-            e.preventDefault();
-            onPopulate();
-          }}
+          onSubmit={(e) => {}}
         >
           <div className="d-flex gap-3 align-items-end flex-wrap mb-3">
killedBy: CoursesIndexPage tests Populate posts the selected range and level
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] LogicalOperator
main/pages/Admin/CoursesIndexPage.tsx:121:31
           </div>
         </Form>
 
-        <CourseTable courses={courses ?? []} testIdPrefix="CoursesIndexPage" />
+        <CourseTable courses={courses && []} testIdPrefix="CoursesIndexPage" />
       </div>
     </BasicLayout>
killedBy: CoursesIndexPage tests renders the heading, the configured subject area, and the courses
statusReason: Unable to find an element by: [data-testid="CoursesIndexPage-cell-row-0-col-courseId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[NoCoverage] ArrayDeclaration
main/pages/Admin/CoursesIndexPage.tsx:121:42
           </div>
         </Form>
 
-        <CourseTable courses={courses ?? []} testIdPrefix="CoursesIndexPage" />
+        <CourseTable courses={courses ?? ["Stryker was here"]} testIdPrefix="CoursesIndexPage" />
       </div>
     </BasicLayout>
