[Killed] ConditionalExpression
main/pages/Home/HomePageLoggedIn.jsx:23:10
           Welcome, {currentUser.root?.user?.givenName ?? "Gaucho"}.
         </p>
 
-        {isAdmin && (
-          <p data-testid="HomePageLoggedIn-admin">
-            You are an admin. Use the Admin menu to manage instructors and grad
-            students.
-          </p>
-        )}
+        {false}
         {isInstructor && (
           <p data-testid="HomePageLoggedIn-instructor">
killedBy: HomePageLoggedIn tests an admin sees the admin message but is not treated as a grad student
statusReason: Unable to find an element by: [data-testid="HomePageLoggedIn-admin"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ConditionalExpression
main/pages/Home/HomePageLoggedIn.jsx:29:10
             students.
           </p>
         )}
-        {isInstructor && (
-          <p data-testid="HomePageLoggedIn-instructor">
-            You are an instructor.
-          </p>
-        )}
+        {false}
         {isGradStudent && (
           <p data-testid="HomePageLoggedIn-gradstudent">
killedBy: HomePageLoggedIn tests an instructor sees the instructor message and not the ULA message
statusReason: Unable to find an element by: [data-testid="HomePageLoggedIn-instructor"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ConditionalExpression
main/pages/Home/HomePageLoggedIn.jsx:34:10
             You are an instructor.
           </p>
         )}
-        {isGradStudent && (
-          <p data-testid="HomePageLoggedIn-gradstudent">
-            You are a grad student, so you will be able to apply for TA
-            positions once applications open.
-          </p>
-        )}
+        {false}
         {isUndergrad && (
           <div data-testid="HomePageLoggedIn-undergrad">
killedBy: HomePageLoggedIn tests a grad student sees the TA message and not the ULA message
statusReason: Unable to find an element by: [data-testid="HomePageLoggedIn-gradstudent"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ConditionalExpression
main/pages/Home/HomePageLoggedIn.jsx:40:10
             positions once applications open.
           </p>
         )}
-        {isUndergrad && (
-          <div data-testid="HomePageLoggedIn-undergrad">
-            <p>
-              You will be able to apply for ULA positions once applications
-              open.
-            </p>
-            <p>If you:</p>
-            <ul>
-              <li>
-                are an instructor that needs to review TA/ULA applications
-              </li>
-              <li>are a grad student that wants to apply for TA positions</li>
-            </ul>
-            <p>
-              Please request instructor or grad student access. (TODO: Insert
-              instructions here.)
-            </p>
-          </div>
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: HomePageLoggedIn tests the ULA message is shown for ROLE_UNDERGRAD
statusReason: Unable to find an element by: [data-testid="HomePageLoggedIn-undergrad"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ConditionalExpression
main/pages/Home/HomePageLoggedIn.jsx:40:10
             positions once applications open.
           </p>
         )}
-        {isUndergrad && (
-          <div data-testid="HomePageLoggedIn-undergrad">
-            <p>
-              You will be able to apply for ULA positions once applications
-              open.
-            </p>
-            <p>If you:</p>
-            <ul>
-              <li>
-                are an instructor that needs to review TA/ULA applications
-              </li>
-              <li>are a grad student that wants to apply for TA positions</li>
-            </ul>
-            <p>
-              Please request instructor or grad student access. (TODO: Insert
-              instructions here.)
-            </p>
-          </div>
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: HomePageLoggedIn tests the ULA message is shown for ROLE_UNDERGRAD
statusReason: Unable to find an element by: [data-testid="HomePageLoggedIn-undergrad"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"
