[Killed] StringLiteral
src/main/utils/quarterUtilities.jsx:1:49
-const quarters = ["WINTER", "SPRING", "SUMMER", "FALL"];
+const quarters = ["WINTER", "SPRING", "SUMMER", ""];
 
 const shortQuarters = ["W", "S", "M", "F"];
killedBy: QuarterFormSelect conversion tests fromFormat correctly converts
statusReason: expected ' 1998' to be 'FALL 1998' // Object.is equality

[Killed] ArrayDeclaration
src/main/utils/quarterUtilities.jsx:3:23
 const quarters = ["WINTER", "SPRING", "SUMMER", "FALL"];
 
-const shortQuarters = ["W", "S", "M", "F"];
+const shortQuarters = [];
 
 const qtrNumToQuarter = {
killedBy: QuarterFormSelect conversion tests yyyyqToQyy correctly converts
statusReason: expected 'undefined21' to be 'W21' // Object.is equality

[Killed] StringLiteral
src/main/utils/quarterUtilities.jsx:6:6
 const shortQuarters = ["W", "S", "M", "F"];
 
 const qtrNumToQuarter = {
-  1: "WINTER",
+  1: "",
   2: "SPRING",
   3: "SUMMER",
killedBy: QuarterFormSelect conversion tests qtrNumToQuarter converts property
statusReason: expected '' to be 'WINTER' // Object.is equality

[Killed] StringLiteral
src/main/utils/quarterUtilities.jsx:7:6
 
 const qtrNumToQuarter = {
   1: "WINTER",
-  2: "SPRING",
+  2: "",
   3: "SUMMER",
   4: "FALL",
killedBy: QuarterFormSelect conversion tests qtrNumToQuarter converts property
statusReason: expected '' to be 'SPRING' // Object.is equality

[Killed] MethodExpression
src/main/utils/quarterUtilities.jsx:24:57
 };
 
 const fromFormat = (format) => {
-  return `${quarters[parseInt(format.charAt(4)) - 1]} ${format.substring(
-    0,
-    4,
-  )}`;
+  return `${quarters[parseInt(format.charAt(4)) - 1]} ${format}`;
 };
 
killedBy: QuarterFormSelect conversion tests fromFormat correctly converts
statusReason: expected 'WINTER 20211' to be 'WINTER 2021' // Object.is equality

[Killed] BlockStatement
src/main/utils/quarterUtilities.jsx:35:30
     throw new Error("param should be a number");
   }
   const yyyyqStr = yyyyqInt.toString();
-  if (yyyyqStr.length !== 5) {
-    throw new Error("param should be five digits");
-  }
+  if (yyyyqStr.length !== 5) {}
   const qStr = yyyyqStr.substring(4, 5);
   if (!(qStr in qtrNumToQuarter)) {
killedBy: QuarterFormSelect conversion tests fromNumericYYYYQ correctly throws errors
statusReason: expected [Function] to throw error including 'param should be five digits' but got 'param should end in 1,2,3 or 4'

[Killed] BlockStatement
src/main/utils/quarterUtilities.jsx:39:35
     throw new Error("param should be five digits");
   }
   const qStr = yyyyqStr.substring(4, 5);
-  if (!(qStr in qtrNumToQuarter)) {
-    throw new Error("param should end in 1,2,3 or 4");
-  }
+  if (!(qStr in qtrNumToQuarter)) {}
   return yyyyqStr;
 };
killedBy: QuarterFormSelect conversion tests fromNumericYYYYQ correctly throws errors
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/main/utils/quarterUtilities.jsx:46:7
 };
 
 const toNumericYYYYQ = (yyyyqStr) => {
-  if (typeof yyyyqStr !== "string") {
+  if (true) {
     throw new Error("param should be a string");
   }
killedBy: QuarterFormSelect conversion tests toNumericYYYYQ correctly converts
statusReason: param should be a string

[Killed] StringLiteral
src/main/utils/quarterUtilities.jsx:50:21
     throw new Error("param should be a string");
   }
   if (yyyyqStr.length !== 5) {
-    throw new Error("param should be five digits");
+    throw new Error("");
   }
   const qStr = yyyyqStr.substring(4, 5);
killedBy: QuarterFormSelect conversion tests toNumericYYYYQ correctly throws errors
statusReason: expected [Function] to throw error including 'param should be five digits' but got ''

[Killed] ConditionalExpression
src/main/utils/quarterUtilities.jsx:63:7
   const _yyyyqStr = fromNumericYYYYQ(yyyyqInt); // just for type/format checking
   const qInt = yyyyqInt % 10;
   const yyyyInt = Math.floor(yyyyqInt / 10);
-  if (qInt < 4) {
+  if (false) {
     return yyyyqInt + 1;
   }
killedBy: QuarterFormSelect conversion tests nextQuarter correctly increments
statusReason: expected 20221 to be 20212 // Object.is equality
