[Killed] BooleanLiteral
main/pages/Admin/GradStudentsCreatePage.tsx:15:15
 };
 
 export default function GradStudentsCreatePage({
-  storybook = false,
+  storybook = true,
 }: GradStudentsCreatePageProps): React.JSX.Element {
   const navigation = useNavigate();
killedBy: GradStudentsCreatePage tests on submit, makes request to backend, and redirects to /admin/gradstudents
statusReason: expected "vi.fn()" to be called with arguments: [ '/admin/gradstudents' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ArrowFunction
main/pages/Admin/GradStudentsCreatePage.tsx:18:31
   storybook = false,
 }: GradStudentsCreatePageProps): React.JSX.Element {
   const navigation = useNavigate();
-  const objectToAxiosParams = (
-    gradStudent: RoleEmailFormFields,
-  ): AxiosRequestConfig => ({
-    url: "/api/admin/gradstudents/post",
-    method: "POST",
-    params: {
-      email: gradStudent.email,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (gradStudent: RoleEmailFormFields) => {
killedBy: GradStudentsCreatePage tests on submit, makes request to backend, and redirects to /admin/gradstudents
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/pages/Admin/GradStudentsCreatePage.tsx:21:10
   const objectToAxiosParams = (
     gradStudent: RoleEmailFormFields,
   ): AxiosRequestConfig => ({
-    url: "/api/admin/gradstudents/post",
+    url: "",
     method: "POST",
     params: {
killedBy: GradStudentsCreatePage tests on submit, makes request to backend, and redirects to /admin/gradstudents
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "New grad student added - email: testemailone@ucsb.edu",

[Killed] ObjectLiteral
main/pages/Admin/GradStudentsCreatePage.tsx:23:13
   ): AxiosRequestConfig => ({
     url: "/api/admin/gradstudents/post",
     method: "POST",
-    params: {
-      email: gradStudent.email,
-    },
+    params: {},
   });
 
killedBy: GradStudentsCreatePage tests on submit, makes request to backend, and redirects to /admin/gradstudents
statusReason: expected {} to deeply equal { email: 'testemailone@ucsb.edu' }

[Killed] BlockStatement
main/pages/Admin/GradStudentsCreatePage.tsx:28:59
     },
   });
 
-  const onSuccess = (gradStudent: RoleEmailFormFields) => {
-    toast(`New grad student added - email: ${gradStudent.email}`);
-    if (!storybook) navigation("/admin/gradstudents");
-  };
+  const onSuccess = (gradStudent: RoleEmailFormFields) => {};
 
   const mutation = useBackendMutation(
killedBy: GradStudentsCreatePage tests on submit, makes request to backend, and redirects to /admin/gradstudents
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] BooleanLiteral
main/pages/Admin/GradStudentsCreatePage.tsx:30:9
 
   const onSuccess = (gradStudent: RoleEmailFormFields) => {
     toast(`New grad student added - email: ${gradStudent.email}`);
-    if (!storybook) navigation("/admin/gradstudents");
+    if (storybook) navigation("/admin/gradstudents");
   };
 
killedBy: GradStudentsCreatePage tests on submit, makes request to backend, and redirects to /admin/gradstudents
statusReason: expected "vi.fn()" to be called with arguments: [ '/admin/gradstudents' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
main/pages/Admin/GradStudentsCreatePage.tsx:30:9
 
   const onSuccess = (gradStudent: RoleEmailFormFields) => {
     toast(`New grad student added - email: ${gradStudent.email}`);
-    if (!storybook) navigation("/admin/gradstudents");
+    if (true) navigation("/admin/gradstudents");
   };
 
killedBy: GradStudentsCreatePage tests on storybook, no redirect
statusReason: expected "vi.fn()" to not be called with arguments: [ '/admin/gradstudents' ]

Received:

  1st vi.fn() call:

Compared values have no visual difference.

[Killed] StringLiteral
main/pages/Admin/GradStudentsCreatePage.tsx:37:6
     objectToAxiosParams,
     { onSuccess },
     // Must match the key the index page reads ("/get"); invalidating "/all" hit nothing.
-    ["/api/admin/gradstudents/get"],
+    [""],
   );
 
killedBy: GradStudentsCreatePage tests useBackendMutation is called with correct cache query key
statusReason: expected "useBackendMutation" to be called with arguments: [ Any<Function>, …(2) ]

Received:

  1st useBackendMutation call:

  [
-   Any<Function>,
