[Killed] ObjectLiteral
main/pages/Admin/GradStudentsIndexPage.tsx:20:5
 export default function GradStudentsIndexPage(): React.JSX.Element {
   const { data: gradstudents } = useBackend<RoleEmail[]>(
     ["/api/admin/gradstudents/get"],
-    { method: "GET", url: "/api/admin/gradstudents/get" },
+    {},
     // Stryker disable next-line all : don't test default value of empty list
     [],
killedBy: GradStudentsIndexPage tests renders three items correctly
statusReason: Unable to find an element by: [data-testid="GradStudentsIndexPage-cell-row-0-col-email"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ArrowFunction
main/pages/Admin/GradStudentsIndexPage.tsx:29:5
     RoleEmailCsvUploadFormFields,
     UploadResult
   >(
-    (data) =>
-      csvUploadAxiosParams(
-        "/api/admin/gradstudents/upload/csv",
-        data.upload[0],
-      ),
+    () => undefined,
     { onSuccess: (result: UploadResult) => toast(uploadResultMessage(result)) },
     ["/api/admin/gradstudents/get"],
killedBy: GradStudentsIndexPage tests uploading a CSV posts it and toasts the summary
statusReason: expected [] to have a length of 1 but got +0

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArrowFunction
main/pages/Admin/GradStudentsIndexPage.tsx:34:18
         "/api/admin/gradstudents/upload/csv",
         data.upload[0],
       ),
-    { onSuccess: (result: UploadResult) => toast(uploadResultMessage(result)) },
+    { onSuccess: () => undefined },
     ["/api/admin/gradstudents/get"],
   );
killedBy: GradStudentsIndexPage tests uploading a CSV posts it and toasts the summary
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Upload complete: 2 added, 1 already present, 0 invalid",

[Survived] ArrayDeclaration
main/pages/Admin/GradStudentsIndexPage.tsx:35:5
         data.upload[0],
       ),
     { onSuccess: (result: UploadResult) => toast(uploadResultMessage(result)) },
-    ["/api/admin/gradstudents/get"],
+    [],
   );
 

[Killed] BlockStatement
main/pages/Admin/GradStudentsIndexPage.tsx:38:66
     ["/api/admin/gradstudents/get"],
   );
 
-  const onUpload = async (data: RoleEmailCsvUploadFormFields) => {
-    uploadMutation.mutate(data);
-  };
+  const onUpload = async (data: RoleEmailCsvUploadFormFields) => {};
 
   const createButton = () => {
killedBy: GradStudentsIndexPage tests uploading a CSV posts it and toasts the summary
statusReason: expected [] to have a length of 1 but got +0

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/pages/Admin/GradStudentsIndexPage.tsx:42:30
     uploadMutation.mutate(data);
   };
 
-  const createButton = () => {
-    return (
-      <Link
-        className="btn btn-primary"
-        to="/admin/gradstudents/create"
-        style={{ float: "right" }}
-      >
-        New Grad Student
-      </Link>
-    );
-  };
+  const createButton = () => {};
 
   return (
killedBy: GradStudentsIndexPage tests Renders with New Grad Student Button
statusReason: Unable to find an element with the text: /New Grad Student/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ObjectLiteral
main/pages/Admin/GradStudentsIndexPage.tsx:47:16
       <Link
         className="btn btn-primary"
         to="/admin/gradstudents/create"
-        style={{ float: "right" }}
+        style={{}}
       >
         New Grad Student
killedBy: GradStudentsIndexPage tests Renders with New Grad Student Button
statusReason: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null

[Killed] LogicalOperator
main/pages/Admin/GradStudentsIndexPage.tsx:60:17
         {createButton()}
         <h1>Grad Students</h1>
         <RoleEmailTable
-          data={gradstudents ?? []}
+          data={gradstudents && []}
           deleteEndpoint="/api/admin/gradstudents/delete"
           getEndpoint="/api/admin/gradstudents/get"
killedBy: GradStudentsIndexPage tests renders three items correctly
statusReason: Unable to find an element by: [data-testid="GradStudentsIndexPage-cell-row-0-col-email"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"
