[Killed] StringLiteral
main/pages/Home/HomePageLoggedIn.jsx:11:40
 export default function HomePageLoggedIn() {
   const currentUser = useCurrentUser();
 
-  const isAdmin = hasRole(currentUser, "ROLE_ADMIN");
+  const isAdmin = hasRole(currentUser, "");
   const isInstructor = hasRole(currentUser, "ROLE_INSTRUCTOR");
   const isGradStudent = hasRole(currentUser, "ROLE_GRAD_STUDENT");
killedBy: HomePageLoggedIn tests an admin sees the admin message but is not treated as an applicant
statusReason: Unable to find an element by: [data-testid="HomePageLoggedIn-admin"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] StringLiteral
main/pages/Home/HomePageLoggedIn.jsx:12:45
   const currentUser = useCurrentUser();
 
   const isAdmin = hasRole(currentUser, "ROLE_ADMIN");
-  const isInstructor = hasRole(currentUser, "ROLE_INSTRUCTOR");
+  const isInstructor = hasRole(currentUser, "");
   const isGradStudent = hasRole(currentUser, "ROLE_GRAD_STUDENT");
   // Granted by the backend to a UCSB address holding none of the other roles.
killedBy: HomePageLoggedIn tests an instructor sees the instructor message and no dashboard
statusReason: Unable to find an element by: [data-testid="HomePageLoggedIn-instructor"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] StringLiteral
main/pages/Home/HomePageLoggedIn.jsx:15:44
   const isInstructor = hasRole(currentUser, "ROLE_INSTRUCTOR");
   const isGradStudent = hasRole(currentUser, "ROLE_GRAD_STUDENT");
   // Granted by the backend to a UCSB address holding none of the other roles.
-  const isUndergrad = hasRole(currentUser, "ROLE_UNDERGRAD");
+  const isUndergrad = hasRole(currentUser, "");
 
   // Grad students apply for TA positions, undergrads for ULA ones. The backend filters every
killedBy: HomePageLoggedIn tests the request-access message is shown for ROLE_UNDERGRAD
statusReason: Unable to find an element by: [data-testid="HomePageLoggedIn-undergrad"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] LogicalOperator
main/pages/Home/HomePageLoggedIn.jsx:19:23
 
   // Grad students apply for TA positions, undergrads for ULA ones. The backend filters every
   // one of these responses to that same type, so nothing here can widen it.
-  const isApplicant = isGradStudent || isUndergrad;
+  const isApplicant = isGradStudent && isUndergrad;
   const applicantType = isGradStudent ? "TA" : "ULA";
 
killedBy: HomePageLoggedIn tests a grad student is told about TA positions
statusReason: Unable to find an element by: [data-testid="HomePageLoggedIn-dashboard-none-open"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ConditionalExpression
main/pages/Home/HomePageLoggedIn.jsx:19:23
 
   // Grad students apply for TA positions, undergrads for ULA ones. The backend filters every
   // one of these responses to that same type, so nothing here can widen it.
-  const isApplicant = isGradStudent || isUndergrad;
+  const isApplicant = true;
   const applicantType = isGradStudent ? "TA" : "ULA";
 
killedBy: HomePageLoggedIn tests an admin sees the admin message but is not treated as an applicant
statusReason: expected <div …(1)><p …(1)></p>
…(2)</div> to be null

[Killed] StringLiteral
main/pages/Home/HomePageLoggedIn.jsx:45:27
   );
   const { data: recentlyClosed } = useBackend(
     ["/api/recruitments/recentlyClosed"],
-    { method: "GET", url: "/api/recruitments/recentlyClosed" },
+    { method: "GET", url: "" },
     // Stryker disable next-line all : don't test default value of empty list
     [],
killedBy: HomePageLoggedIn tests a recently closed recruitment reports its dates
statusReason: Unable to find an element by: [data-testid="HomePageLoggedIn-dashboard-closed-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Survived] StringLiteral
main/pages/Home/HomePageLoggedIn.jsx:45:15
   );
   const { data: recentlyClosed } = useBackend(
     ["/api/recruitments/recentlyClosed"],
-    { method: "GET", url: "/api/recruitments/recentlyClosed" },
+    { method: "", url: "/api/recruitments/recentlyClosed" },
     // Stryker disable next-line all : don't test default value of empty list
     [],

[Survived] ArrayDeclaration
main/pages/Home/HomePageLoggedIn.jsx:60:5
     options,
   );
   const { data: applications } = useBackend(
-    ["/api/applications/mine"],
+    [],
     { method: "GET", url: "/api/applications/mine" },
     // Stryker disable next-line all : don't test default value of empty list

[Killed] StringLiteral
main/pages/Home/HomePageLoggedIn.jsx:61:27
   );
   const { data: applications } = useBackend(
     ["/api/applications/mine"],
-    { method: "GET", url: "/api/applications/mine" },
+    { method: "GET", url: "" },
     // Stryker disable next-line all : don't test default value of empty list
     [],
killedBy: HomePageLoggedIn tests the applicant's own applications are listed
statusReason: Unable to find an element by: [data-testid="HomePageLoggedIn-dashboard-applications-cell-row-0-col-status"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] LogicalOperator
main/pages/Home/HomePageLoggedIn.jsx:87:10
             You are an instructor.
           </p>
         )}
-        {isUndergrad && (
-          <div data-testid="HomePageLoggedIn-undergrad">
-            <p>If you:</p>
-            <ul>
-              <li>
-                are an instructor that needs to review TA/ULA applications
-              </li>
-              <li>are a grad student that wants to apply for TA positions</li>
-            </ul>
-            <p>
-              Please request instructor or grad student access. (TODO: Insert
-              instructions here.)
-            </p>
-          </div>
-        )}
+        {isUndergrad || <div data-testid="HomePageLoggedIn-undergrad">
+            <p>If you:</p>
+            <ul>
+              <li>
+                are an instructor that needs to review TA/ULA applications
+              </li>
+              <li>are a grad student that wants to apply for TA positions</li>
+            </ul>
+            <p>
+              Please request instructor or grad student access. (TODO: Insert
+              instructions here.)
+            </p>
+          </div>}
 
         {isApplicant && (
killedBy: HomePageLoggedIn tests a signed-in user without ROLE_UNDERGRAD sees no request-access message
statusReason: expected <div …(1)><p></p>
…(2)</div> to be null

[Killed] ConditionalExpression
main/pages/Home/HomePageLoggedIn.jsx:87:10
             You are an instructor.
           </p>
         )}
-        {isUndergrad && (
-          <div data-testid="HomePageLoggedIn-undergrad">
-            <p>If you:</p>
-            <ul>
-              <li>
-                are an instructor that needs to review TA/ULA applications
-              </li>
-              <li>are a grad student that wants to apply for TA positions</li>
-            </ul>
-            <p>
-              Please request instructor or grad student access. (TODO: Insert
-              instructions here.)
-            </p>
-          </div>
-        )}
+        {false}
 
         {isApplicant && (
killedBy: HomePageLoggedIn tests the request-access message is shown for ROLE_UNDERGRAD
statusReason: Unable to find an element by: [data-testid="HomePageLoggedIn-undergrad"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ConditionalExpression
main/pages/Home/HomePageLoggedIn.jsx:103:10
           </div>
         )}
 
-        {isApplicant && (
-          <ApplicantDashboard
-            type={applicantType}
-            open={open}
-            upcoming={upcoming}
-            recentlyClosed={recentlyClosed}
-            applications={applications}
-            applicable={applicable}
-            testIdPrefix="HomePageLoggedIn-dashboard"
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: HomePageLoggedIn tests a grad student is told about TA positions
statusReason: Unable to find an element by: [data-testid="HomePageLoggedIn-dashboard-none-open"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ConditionalExpression
main/pages/Home/HomePageLoggedIn.jsx:103:10
           </div>
         )}
 
-        {isApplicant && (
-          <ApplicantDashboard
-            type={applicantType}
-            open={open}
-            upcoming={upcoming}
-            recentlyClosed={recentlyClosed}
-            applications={applications}
-            applicable={applicable}
-            testIdPrefix="HomePageLoggedIn-dashboard"
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: HomePageLoggedIn tests a grad student is told about TA positions
statusReason: Unable to find an element by: [data-testid="HomePageLoggedIn-dashboard-none-open"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"
