[Killed] BooleanLiteral
main/pages/Admin/InstructorsCreatePage.tsx:15:15
 };
 
 export default function InstructorsCreatePage({
-  storybook = false,
+  storybook = true,
 }: InstructorsCreatePageProps): React.JSX.Element {
   const navigation = useNavigate();
killedBy: InstructorsCreatePage tests on submit, makes request to backend, and redirects to /admin/instructors
statusReason: expected "vi.fn()" to be called with arguments: [ '/admin/instructors' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ArrowFunction
main/pages/Admin/InstructorsCreatePage.tsx:18:31
   storybook = false,
 }: InstructorsCreatePageProps): React.JSX.Element {
   const navigation = useNavigate();
-  const objectToAxiosParams = (
-    instructor: RoleEmailFormFields,
-  ): AxiosRequestConfig => ({
-    url: "/api/admin/instructors/post",
-    method: "POST",
-    params: {
-      email: instructor.email,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (instructor: RoleEmailFormFields) => {
killedBy: InstructorsCreatePage tests on submit, makes request to backend, and redirects to /admin/instructors
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
main/pages/Admin/InstructorsCreatePage.tsx:20:29
   const navigation = useNavigate();
   const objectToAxiosParams = (
     instructor: RoleEmailFormFields,
-  ): AxiosRequestConfig => ({
-    url: "/api/admin/instructors/post",
-    method: "POST",
-    params: {
-      email: instructor.email,
-    },
-  });
+  ): AxiosRequestConfig => ({});
 
   const onSuccess = (instructor: RoleEmailFormFields) => {
killedBy: InstructorsCreatePage tests on submit, makes request to backend, and redirects to /admin/instructors
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
main/pages/Admin/InstructorsCreatePage.tsx:23:13
   ): AxiosRequestConfig => ({
     url: "/api/admin/instructors/post",
     method: "POST",
-    params: {
-      email: instructor.email,
-    },
+    params: {},
   });
 
killedBy: InstructorsCreatePage tests on submit, makes request to backend, and redirects to /admin/instructors
statusReason: expected {} to deeply equal { email: 'testemailone@ucsb.edu' }

[Killed] BlockStatement
main/pages/Admin/InstructorsCreatePage.tsx:28:58
     },
   });
 
-  const onSuccess = (instructor: RoleEmailFormFields) => {
-    toast(`New instructor added - email: ${instructor.email}`);
-    if (!storybook) navigation("/admin/instructors");
-  };
+  const onSuccess = (instructor: RoleEmailFormFields) => {};
 
   const mutation = useBackendMutation(
killedBy: InstructorsCreatePage tests on submit, makes request to backend, and redirects to /admin/instructors
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] ConditionalExpression
main/pages/Admin/InstructorsCreatePage.tsx:30:9
 
   const onSuccess = (instructor: RoleEmailFormFields) => {
     toast(`New instructor added - email: ${instructor.email}`);
-    if (!storybook) navigation("/admin/instructors");
+    if (false) navigation("/admin/instructors");
   };
 
killedBy: InstructorsCreatePage tests on submit, makes request to backend, and redirects to /admin/instructors
statusReason: expected "vi.fn()" to be called with arguments: [ '/admin/instructors' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ArrayDeclaration
main/pages/Admin/InstructorsCreatePage.tsx:37:5
     objectToAxiosParams,
     { onSuccess },
     // Must match the key the index page reads ("/get"); invalidating "/all" hit nothing.
-    ["/api/admin/instructors/get"],
+    [],
   );
 
killedBy: InstructorsCreatePage tests useBackendMutation is called with correct cache query key
statusReason: expected "useBackendMutation" to be called with arguments: [ Any<Function>, …(2) ]

Received:

  1st useBackendMutation call:

  [
-   Any<Function>,
