[Killed] ArrowFunction
main/components/Recruitments/RecruitmentCourseTable.tsx:37:31
   includeRemoved,
   testIdPrefix = "RecruitmentCourseTable",
 }: RecruitmentCourseTableProps): React.JSX.Element {
-  const objectToAxiosParams = (
-    course: RecruitmentCourse,
-  ): AxiosRequestConfig => ({
-    url: "/api/recruitmentcourses/removed",
-    method: "PUT",
-    // Flip it: the button always moves the row to the other state.
-    params: { id: course.id, removed: !course.removed },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const mutation = useBackendMutation<RecruitmentCourse, unknown>(
killedBy: RecruitmentCourseTable tests clicking Remove flags the row as removed
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] BooleanLiteral
main/components/Recruitments/RecruitmentCourseTable.tsx:43:39
     url: "/api/recruitmentcourses/removed",
     method: "PUT",
     // Flip it: the button always moves the row to the other state.
-    params: { id: course.id, removed: !course.removed },
+    params: { id: course.id, removed: course.removed },
   });
 
killedBy: RecruitmentCourseTable tests clicking Remove flags the row as removed
statusReason: expected { id: 1, removed: false } to deeply equal { id: 1, removed: true }

[Killed] ObjectLiteral
main/components/Recruitments/RecruitmentCourseTable.tsx:43:13
     url: "/api/recruitmentcourses/removed",
     method: "PUT",
     // Flip it: the button always moves the row to the other state.
-    params: { id: course.id, removed: !course.removed },
+    params: {},
   });
 
killedBy: RecruitmentCourseTable tests clicking Remove flags the row as removed
statusReason: expected {} to deeply equal { id: 1, removed: true }

[Survived] StringLiteral
main/components/Recruitments/RecruitmentCourseTable.tsx:49:6
   const mutation = useBackendMutation<RecruitmentCourse, unknown>(
     objectToAxiosParams,
     {},
-    ["/api/recruitmentcourses/all", includeRemoved],
+    ["", includeRemoved],
   );
 

[Survived] StringLiteral
main/components/Recruitments/RecruitmentCourseTable.tsx:53:21
   );
 
   const shrinkToContent = {
-    style: { width: "1%", whiteSpace: "nowrap" as const },
+    style: { width: "", whiteSpace: "nowrap" as const },
   };
 

[Killed] ArrowFunction
main/components/Recruitments/RecruitmentCourseTable.tsx:62:13
       accessorKey: "courseId",
       meta: shrinkToContent,
       // Padded and monospaced, exactly as Admin/Courses renders it, so the sort order is legible.
-      cell: ({ cell }: { cell: Cell<RecruitmentCourse, unknown> }) => (
-        <span style={{ whiteSpace: "pre", fontFamily: "monospace" }}>
-          {cell.row.original.courseId}
-        </span>
-      ),
+      cell: () => undefined,
     },
     { header: "Section", accessorKey: "section", meta: shrinkToContent },
killedBy: RecruitmentCourseTable tests shows both primary sections of a course as separate rows
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  CMPSC   156
Received:

[Killed] StringLiteral
main/components/Recruitments/RecruitmentCourseTable.tsx:68:39
         </span>
       ),
     },
-    { header: "Section", accessorKey: "section", meta: shrinkToContent },
+    { header: "Section", accessorKey: "", meta: shrinkToContent },
     {
       header: "Title",
killedBy: RecruitmentCourseTable tests renders the offering details for each primary section
statusReason: Columns require an id when using a non-string header

[Survived] StringLiteral
main/components/Recruitments/RecruitmentCourseTable.tsx:72:31
     {
       header: "Title",
       accessorKey: "title",
-      meta: { style: { width: "100%" } },
+      meta: { style: { width: "" } },
     },
     { header: "Instructor", accessorKey: "instructor", meta: shrinkToContent },

[Survived] ObjectLiteral
main/components/Recruitments/RecruitmentCourseTable.tsx:72:22
     {
       header: "Title",
       accessorKey: "title",
-      meta: { style: { width: "100%" } },
+      meta: { style: {} },
     },
     { header: "Instructor", accessorKey: "instructor", meta: shrinkToContent },

[Killed] ObjectLiteral
main/components/Recruitments/RecruitmentCourseTable.tsx:74:5
       accessorKey: "title",
       meta: { style: { width: "100%" } },
     },
-    { header: "Instructor", accessorKey: "instructor", meta: shrinkToContent },
+    {},
     { header: "Days", accessorKey: "days", meta: shrinkToContent },
     { header: "Time", accessorKey: "time", meta: shrinkToContent },
killedBy: RecruitmentCourseTable tests renders the offering details for each primary section
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Recruitments/RecruitmentCourseTable.tsx:74:42
       accessorKey: "title",
       meta: { style: { width: "100%" } },
     },
-    { header: "Instructor", accessorKey: "instructor", meta: shrinkToContent },
+    { header: "Instructor", accessorKey: "", meta: shrinkToContent },
     { header: "Days", accessorKey: "days", meta: shrinkToContent },
     { header: "Time", accessorKey: "time", meta: shrinkToContent },
killedBy: RecruitmentCoursesPage tests lists the recruitment's courses
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Recruitments/RecruitmentCourseTable.tsx:75:15
       meta: { style: { width: "100%" } },
     },
     { header: "Instructor", accessorKey: "instructor", meta: shrinkToContent },
-    { header: "Days", accessorKey: "days", meta: shrinkToContent },
+    { header: "", accessorKey: "days", meta: shrinkToContent },
     { header: "Time", accessorKey: "time", meta: shrinkToContent },
     { header: "Room", accessorKey: "room", meta: shrinkToContent },
killedBy: RecruitmentCourseTable tests renders the offering details for each primary section
statusReason: Unable to find an element with the text: Days. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="RecruitmentCourseTable"

[Killed] ObjectLiteral
main/components/Recruitments/RecruitmentCourseTable.tsx:75:5
       meta: { style: { width: "100%" } },
     },
     { header: "Instructor", accessorKey: "instructor", meta: shrinkToContent },
-    { header: "Days", accessorKey: "days", meta: shrinkToContent },
+    {},
     { header: "Time", accessorKey: "time", meta: shrinkToContent },
     { header: "Room", accessorKey: "room", meta: shrinkToContent },
killedBy: RecruitmentCoursesPage tests lists the recruitment's courses
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Recruitments/RecruitmentCourseTable.tsx:76:36
     },
     { header: "Instructor", accessorKey: "instructor", meta: shrinkToContent },
     { header: "Days", accessorKey: "days", meta: shrinkToContent },
-    { header: "Time", accessorKey: "time", meta: shrinkToContent },
+    { header: "Time", accessorKey: "", meta: shrinkToContent },
     { header: "Room", accessorKey: "room", meta: shrinkToContent },
     { header: "Enrolled", accessorKey: "enrollment", meta: shrinkToContent },
killedBy: RecruitmentCourseTable tests renders the offering details for each primary section
statusReason: Columns require an id when using a non-string header

[Killed] ObjectLiteral
main/components/Recruitments/RecruitmentCourseTable.tsx:77:5
     { header: "Instructor", accessorKey: "instructor", meta: shrinkToContent },
     { header: "Days", accessorKey: "days", meta: shrinkToContent },
     { header: "Time", accessorKey: "time", meta: shrinkToContent },
-    { header: "Room", accessorKey: "room", meta: shrinkToContent },
+    {},
     { header: "Enrolled", accessorKey: "enrollment", meta: shrinkToContent },
     { header: "Max", accessorKey: "maxEnroll", meta: shrinkToContent },
killedBy: RecruitmentCoursesPage tests lists the recruitment's courses
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Recruitments/RecruitmentCourseTable.tsx:77:36
     { header: "Instructor", accessorKey: "instructor", meta: shrinkToContent },
     { header: "Days", accessorKey: "days", meta: shrinkToContent },
     { header: "Time", accessorKey: "time", meta: shrinkToContent },
-    { header: "Room", accessorKey: "room", meta: shrinkToContent },
+    { header: "Room", accessorKey: "", meta: shrinkToContent },
     { header: "Enrolled", accessorKey: "enrollment", meta: shrinkToContent },
     { header: "Max", accessorKey: "maxEnroll", meta: shrinkToContent },
killedBy: RecruitmentCourseTable tests renders the offering details for each primary section
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Recruitments/RecruitmentCourseTable.tsx:78:40
     { header: "Days", accessorKey: "days", meta: shrinkToContent },
     { header: "Time", accessorKey: "time", meta: shrinkToContent },
     { header: "Room", accessorKey: "room", meta: shrinkToContent },
-    { header: "Enrolled", accessorKey: "enrollment", meta: shrinkToContent },
+    { header: "Enrolled", accessorKey: "", meta: shrinkToContent },
     { header: "Max", accessorKey: "maxEnroll", meta: shrinkToContent },
     { header: "Status", accessorKey: "status", meta: shrinkToContent },
killedBy: RecruitmentCourseTable tests renders the offering details for each primary section
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Recruitments/RecruitmentCourseTable.tsx:78:15
     { header: "Days", accessorKey: "days", meta: shrinkToContent },
     { header: "Time", accessorKey: "time", meta: shrinkToContent },
     { header: "Room", accessorKey: "room", meta: shrinkToContent },
-    { header: "Enrolled", accessorKey: "enrollment", meta: shrinkToContent },
+    { header: "", accessorKey: "enrollment", meta: shrinkToContent },
     { header: "Max", accessorKey: "maxEnroll", meta: shrinkToContent },
     { header: "Status", accessorKey: "status", meta: shrinkToContent },
killedBy: RecruitmentCourseTable tests renders the offering details for each primary section
statusReason: Unable to find an element with the text: Enrolled. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="RecruitmentCourseTable"

[Killed] StringLiteral
main/components/Recruitments/RecruitmentCourseTable.tsx:79:15
     { header: "Time", accessorKey: "time", meta: shrinkToContent },
     { header: "Room", accessorKey: "room", meta: shrinkToContent },
     { header: "Enrolled", accessorKey: "enrollment", meta: shrinkToContent },
-    { header: "Max", accessorKey: "maxEnroll", meta: shrinkToContent },
+    { header: "", accessorKey: "maxEnroll", meta: shrinkToContent },
     { header: "Status", accessorKey: "status", meta: shrinkToContent },
     // Always present, though only summer offerings carry a value.
killedBy: RecruitmentCourseTable tests renders the offering details for each primary section
statusReason: Unable to find an element with the text: Max. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="RecruitmentCourseTable"

[Survived] StringLiteral
main/components/Recruitments/RecruitmentCourseTable.tsx:88:15
       meta: shrinkToContent,
     },
     {
-      header: "",
+      header: "Stryker was here!",
       id: "removed",
       accessorKey: "removed",

[Survived] StringLiteral
main/components/Recruitments/RecruitmentCourseTable.tsx:90:20
     {
       header: "",
       id: "removed",
-      accessorKey: "removed",
+      accessorKey: "",
       meta: shrinkToContent,
       // The button's own label and colour say whether the row is removed, so no separate

[Killed] BlockStatement
main/components/Recruitments/RecruitmentCourseTable.tsx:94:71
       meta: shrinkToContent,
       // The button's own label and colour say whether the row is removed, so no separate
       // status column is needed. Removed rows only appear when "show removed" is on.
-      cell: ({ cell }: { cell: Cell<RecruitmentCourse, unknown> }) => {
-        const course = cell.row.original;
-        return (
-          <Button
-            variant={course.removed ? "success" : "danger"}
-            onClick={() => mutation.mutate(course)}
-            data-testid={`${testIdPrefix}-cell-row-${cell.row.index}-col-removed-button`}
-          >
-            {course.removed ? "Unremove" : "Remove"}
-          </Button>
-        );
-      },
+      cell: ({ cell }: { cell: Cell<RecruitmentCourse, unknown> }) => {},
     },
   ];
killedBy: RecruitmentCourseTable tests an ordinary row offers Remove
statusReason: Unable to find an element by: [data-testid="RecruitmentCourseTable-cell-row-0-col-removed-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="RecruitmentCourseTable"

[Killed] ArrowFunction
main/components/Recruitments/RecruitmentCourseTable.tsx:99:22
         return (
           <Button
             variant={course.removed ? "success" : "danger"}
-            onClick={() => mutation.mutate(course)}
+            onClick={() => undefined}
             data-testid={`${testIdPrefix}-cell-row-${cell.row.index}-col-removed-button`}
           >
killedBy: RecruitmentCourseTable tests clicking Remove flags the row as removed
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] StringLiteral
main/components/Recruitments/RecruitmentCourseTable.tsx:100:26
           <Button
             variant={course.removed ? "success" : "danger"}
             onClick={() => mutation.mutate(course)}
-            data-testid={`${testIdPrefix}-cell-row-${cell.row.index}-col-removed-button`}
+            data-testid={``}
           >
             {course.removed ? "Unremove" : "Remove"}
killedBy: RecruitmentCoursesPage tests the toggle asks the backend for removed courses too
statusReason: Unable to find an element by: [data-testid="RecruitmentCoursesPage-cell-row-3-col-removed-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"
