[NoCoverage] StringLiteral
main/components/Recruitments/RecruitmentTable.tsx:28:18
 export default function RecruitmentTable({
   recruitments,
   onDeleteRequested,
-  testIdPrefix = "RecruitmentTable",
+  testIdPrefix = "",
 }: RecruitmentTableProps): React.JSX.Element {
   const statusMutation = useBackendMutation<Recruitment, unknown>(

[Killed] ArrowFunction
main/components/Recruitments/RecruitmentTable.tsx:31:5
   testIdPrefix = "RecruitmentTable",
 }: RecruitmentTableProps): React.JSX.Element {
   const statusMutation = useBackendMutation<Recruitment, unknown>(
-    (recruitment) => ({
-      url: "/api/admin/recruitments/status",
-      method: "PUT",
-      params: {
-        id: recruitment.id,
-        // The button always moves it to the other state.
-        status: recruitment.applicationStatus === "OPEN" ? "CLOSED" : "OPEN",
-      },
-    }),
+    () => undefined,
     {},
     ["/api/admin/recruitments/all"],
killedBy: RecruitmentTable tests clicking Open asks the backend to open it
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Survived] StringLiteral
main/components/Recruitments/RecruitmentTable.tsx:32:12
 }: RecruitmentTableProps): React.JSX.Element {
   const statusMutation = useBackendMutation<Recruitment, unknown>(
     (recruitment) => ({
-      url: "/api/admin/recruitments/status",
+      url: "",
       method: "PUT",
       params: {

[Killed] EqualityOperator
main/components/Recruitments/RecruitmentTable.tsx:37:17
       params: {
         id: recruitment.id,
         // The button always moves it to the other state.
-        status: recruitment.applicationStatus === "OPEN" ? "CLOSED" : "OPEN",
+        status: recruitment.applicationStatus !== "OPEN" ? "CLOSED" : "OPEN",
       },
     }),
killedBy: RecruitmentTable tests clicking Open asks the backend to open it
statusReason: expected { id: 3, status: 'CLOSED' } to deeply equal { id: 3, status: 'OPEN' }

[Killed] ConditionalExpression
main/components/Recruitments/RecruitmentTable.tsx:37:17
       params: {
         id: recruitment.id,
         // The button always moves it to the other state.
-        status: recruitment.applicationStatus === "OPEN" ? "CLOSED" : "OPEN",
+        status: false ? "CLOSED" : "OPEN",
       },
     }),
killedBy: RecruitmentTable tests clicking Close asks the backend to close it
statusReason: expected { id: 2, status: 'OPEN' } to deeply equal { id: 2, status: 'CLOSED' }

[Survived] StringLiteral
main/components/Recruitments/RecruitmentTable.tsx:41:6
       },
     }),
     {},
-    ["/api/admin/recruitments/all"],
+    [""],
   );
 

[Survived] ObjectLiteral
main/components/Recruitments/RecruitmentTable.tsx:45:12
   );
 
   const shrinkToContent = {
-    style: { width: "1%", whiteSpace: "nowrap" as const },
+    style: {},
   };
 

[Killed] ArrowFunction
main/components/Recruitments/RecruitmentTable.tsx:54:13
       accessorKey: "quarter",
       meta: shrinkToContent,
       // Stored as YYYYQ so it sorts; shown as QYY because that is how people say it.
-      cell: ({ cell }: { cell: Cell<Recruitment, unknown> }) =>
-        yyyyqToQyy(cell.row.original.quarter),
+      cell: () => undefined,
     },
     { header: "Type", accessorKey: "type", meta: shrinkToContent },
killedBy: RecruitmentsIndexPage tests renders the heading and the recruitments
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  S26
Received:

[Killed] ObjectLiteral
main/components/Recruitments/RecruitmentTable.tsx:63:5
       accessorKey: "applicationStatus",
       meta: shrinkToContent,
     },
-    {
-      header: "Tentative Opening",
-      accessorKey: "tentativeOpeningDate",
-      meta: shrinkToContent,
-    },
+    {},
     {
       header: "Primary Consideration",
killedBy: RecruitmentTable tests renders the expected headers in order
statusReason: Columns require an id when using a non-string header

[Killed] ObjectLiteral
main/components/Recruitments/RecruitmentTable.tsx:68:5
       accessorKey: "tentativeOpeningDate",
       meta: shrinkToContent,
     },
-    {
-      header: "Primary Consideration",
-      accessorKey: "primaryConsiderationDate",
-      meta: shrinkToContent,
-    },
+    {},
     {
       header: "Actually Opened",
killedBy: RecruitmentTable tests renders the expected headers in order
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Recruitments/RecruitmentTable.tsx:74:15
       meta: shrinkToContent,
     },
     {
-      header: "Actually Opened",
+      header: "",
       accessorKey: "actualOpeningDate",
       meta: shrinkToContent,
killedBy: RecruitmentTable tests renders the expected headers in order
statusReason: expected [ 'Quarter', 'Type', 'Status', …(7) ] to deeply equal [ 'Quarter', 'Type', 'Status', …(7) ]

[Killed] StringLiteral
main/components/Recruitments/RecruitmentTable.tsx:75:20
     },
     {
       header: "Actually Opened",
-      accessorKey: "actualOpeningDate",
+      accessorKey: "",
       meta: shrinkToContent,
     },
killedBy: RecruitmentTable tests renders the expected headers in order
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Recruitments/RecruitmentTable.tsx:79:15
       meta: shrinkToContent,
     },
     {
-      header: "Actually Closed",
+      header: "",
       accessorKey: "actualClosingDate",
       meta: { style: { width: "100%" } },
killedBy: RecruitmentTable tests renders the expected headers in order
statusReason: expected [ 'Quarter', 'Type', 'Status', …(7) ] to deeply equal [ 'Quarter', 'Type', 'Status', …(7) ]

[Killed] StringLiteral
main/components/Recruitments/RecruitmentTable.tsx:80:20
     },
     {
       header: "Actually Closed",
-      accessorKey: "actualClosingDate",
+      accessorKey: "",
       meta: { style: { width: "100%" } },
     },
killedBy: RecruitmentTable tests renders the expected headers in order
statusReason: Columns require an id when using a non-string header

[Survived] ObjectLiteral
main/components/Recruitments/RecruitmentTable.tsx:81:22
     {
       header: "Actually Closed",
       accessorKey: "actualClosingDate",
-      meta: { style: { width: "100%" } },
+      meta: { style: {} },
     },
     {

[Killed] BlockStatement
main/components/Recruitments/RecruitmentTable.tsx:88:65
       id: "status",
       accessorKey: "applicationStatus",
       meta: shrinkToContent,
-      cell: ({ cell }: { cell: Cell<Recruitment, unknown> }) => {
-        const recruitment = cell.row.original;
-        const open = recruitment.applicationStatus === "OPEN";
-        return (
-          <Button
-            variant={open ? "warning" : "success"}
-            onClick={() => statusMutation.mutate(recruitment)}
-            data-testid={`${testIdPrefix}-cell-row-${cell.row.index}-col-status-button`}
-          >
-            {open ? "Close" : "Open"}
-          </Button>
-        );
-      },
+      cell: ({ cell }: { cell: Cell<Recruitment, unknown> }) => {},
     },
     {
killedBy: RecruitmentTable tests a closed recruitment offers Open, an open one offers Close
statusReason: Unable to find an element by: [data-testid="RecruitmentTable-cell-row-0-col-status-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="RecruitmentTable"

[Killed] ConditionalExpression
main/components/Recruitments/RecruitmentTable.tsx:90:22
       meta: shrinkToContent,
       cell: ({ cell }: { cell: Cell<Recruitment, unknown> }) => {
         const recruitment = cell.row.original;
-        const open = recruitment.applicationStatus === "OPEN";
+        const open = true;
         return (
           <Button
killedBy: RecruitmentTable tests a closed recruitment offers Open, an open one offers Close
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Open
Received:
  Close

[Killed] ConditionalExpression
main/components/Recruitments/RecruitmentTable.tsx:90:22
       meta: shrinkToContent,
       cell: ({ cell }: { cell: Cell<Recruitment, unknown> }) => {
         const recruitment = cell.row.original;
-        const open = recruitment.applicationStatus === "OPEN";
+        const open = false;
         return (
           <Button
killedBy: RecruitmentTable tests a closed recruitment offers Open, an open one offers Close
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Close
Received:
  Open

[Killed] ArrowFunction
main/components/Recruitments/RecruitmentTable.tsx:94:22
         return (
           <Button
             variant={open ? "warning" : "success"}
-            onClick={() => statusMutation.mutate(recruitment)}
+            onClick={() => undefined}
             data-testid={`${testIdPrefix}-cell-row-${cell.row.index}-col-status-button`}
           >
killedBy: RecruitmentTable tests clicking Open asks the backend to open it
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] StringLiteral
main/components/Recruitments/RecruitmentTable.tsx:95:26
           <Button
             variant={open ? "warning" : "success"}
             onClick={() => statusMutation.mutate(recruitment)}
-            data-testid={`${testIdPrefix}-cell-row-${cell.row.index}-col-status-button`}
+            data-testid={``}
           >
             {open ? "Close" : "Open"}
killedBy: RecruitmentTable tests a closed recruitment offers Open, an open one offers Close
statusReason: Unable to find an element by: [data-testid="RecruitmentTable-cell-row-0-col-status-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="RecruitmentTable"

[Killed] StringLiteral
main/components/Recruitments/RecruitmentTable.tsx:104:11
     },
     {
       header: "Courses",
-      id: "courses",
+      id: "",
       accessorKey: "id",
       meta: shrinkToContent,
killedBy: RecruitmentTable tests renders the expected headers in order
statusReason: Columns require an id when using a non-string header

[Killed] ArrowFunction
main/components/Recruitments/RecruitmentTable.tsx:107:13
       id: "courses",
       accessorKey: "id",
       meta: shrinkToContent,
-      cell: ({ cell }: { cell: Cell<Recruitment, unknown> }) => (
-        <Link
-          className="btn btn-primary"
-          to={`/admin/recruitments/${cell.row.original.id}/courses`}
-          data-testid={`${testIdPrefix}-cell-row-${cell.row.index}-col-courses-button`}
-        >
-          Courses
-        </Link>
-      ),
+      cell: () => undefined,
     },
     {
killedBy: RecruitmentTable tests the Courses button links to that recruitment's course list
statusReason: Unable to find an element by: [data-testid="RecruitmentTable-cell-row-0-col-courses-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="RecruitmentTable"

[Killed] StringLiteral
main/components/Recruitments/RecruitmentTable.tsx:110:15
       cell: ({ cell }: { cell: Cell<Recruitment, unknown> }) => (
         <Link
           className="btn btn-primary"
-          to={`/admin/recruitments/${cell.row.original.id}/courses`}
+          to={``}
           data-testid={`${testIdPrefix}-cell-row-${cell.row.index}-col-courses-button`}
         >
killedBy: RecruitmentTable tests the Courses button links to that recruitment's course list
statusReason: expect(element).toHaveAttribute("href", "/admin/recruitments/3/courses") // element.getAttribute("href") === "/admin/recruitments/3/courses"

Expected the element to have attribute:
  href="/admin/recruitments/3/courses"
Received:
  href="/"

[Killed] ObjectLiteral
main/components/Recruitments/RecruitmentTable.tsx:117:5
         </Link>
       ),
     },
-    {
-      header: "Delete",
-      id: "delete",
-      accessorKey: "id",
-      meta: shrinkToContent,
-      cell: ({ cell }: { cell: Cell<Recruitment, unknown> }) => (
-        <Button
-          variant="danger"
-          onClick={() => onDeleteRequested(cell.row.original)}
-          data-testid={`${testIdPrefix}-cell-row-${cell.row.index}-col-delete-button`}
-        >
-          Delete
-        </Button>
-      ),
-    },
+    {},
   ];
 
killedBy: RecruitmentTable tests renders the expected headers in order
statusReason: Columns require an id when using a non-string header

[Killed] ArrowFunction
main/components/Recruitments/RecruitmentTable.tsx:122:13
       id: "delete",
       accessorKey: "id",
       meta: shrinkToContent,
-      cell: ({ cell }: { cell: Cell<Recruitment, unknown> }) => (
-        <Button
-          variant="danger"
-          onClick={() => onDeleteRequested(cell.row.original)}
-          data-testid={`${testIdPrefix}-cell-row-${cell.row.index}-col-delete-button`}
-        >
-          Delete
-        </Button>
-      ),
+      cell: () => undefined,
     },
   ];
killedBy: RecruitmentTable tests Delete asks the page rather than deleting directly
statusReason: Unable to find an element by: [data-testid="RecruitmentTable-cell-row-0-col-delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="RecruitmentTable"

[Killed] ArrowFunction
main/components/Recruitments/RecruitmentTable.tsx:125:20
       cell: ({ cell }: { cell: Cell<Recruitment, unknown> }) => (
         <Button
           variant="danger"
-          onClick={() => onDeleteRequested(cell.row.original)}
+          onClick={() => undefined}
           data-testid={`${testIdPrefix}-cell-row-${cell.row.index}-col-delete-button`}
         >
killedBy: RecruitmentTable tests Delete asks the page rather than deleting directly
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times
