[Killed] ArrowFunction
main/pages/Admin/InstructorsIndexPage.tsx:29:5
     RoleEmailCsvUploadFormFields,
     UploadResult
   >(
-    (data) =>
-      csvUploadAxiosParams("/api/admin/instructors/upload/csv", data.upload[0]),
+    () => undefined,
     { onSuccess: (result: UploadResult) => toast(uploadResultMessage(result)) },
     ["/api/admin/instructors/get"],
killedBy: InstructorsIndexPage tests uploading a CSV posts it and toasts the summary
statusReason: expected [] to have a length of 1 but got +0

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/pages/Admin/InstructorsIndexPage.tsx:30:28
     UploadResult
   >(
     (data) =>
-      csvUploadAxiosParams("/api/admin/instructors/upload/csv", data.upload[0]),
+      csvUploadAxiosParams("", data.upload[0]),
     { onSuccess: (result: UploadResult) => toast(uploadResultMessage(result)) },
     ["/api/admin/instructors/get"],
killedBy: InstructorsIndexPage tests uploading a CSV posts it and toasts the summary
statusReason: expected [] to have a length of 1 but got +0

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArrowFunction
main/pages/Admin/InstructorsIndexPage.tsx:31:18
   >(
     (data) =>
       csvUploadAxiosParams("/api/admin/instructors/upload/csv", data.upload[0]),
-    { onSuccess: (result: UploadResult) => toast(uploadResultMessage(result)) },
+    { onSuccess: () => undefined },
     ["/api/admin/instructors/get"],
   );
killedBy: InstructorsIndexPage tests uploading a CSV posts it and toasts the summary
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Upload complete: 2 added, 1 already present, 0 invalid",

[Killed] ObjectLiteral
main/pages/Admin/InstructorsIndexPage.tsx:31:5
   >(
     (data) =>
       csvUploadAxiosParams("/api/admin/instructors/upload/csv", data.upload[0]),
-    { onSuccess: (result: UploadResult) => toast(uploadResultMessage(result)) },
+    {},
     ["/api/admin/instructors/get"],
   );
killedBy: InstructorsIndexPage tests uploading a CSV posts it and toasts the summary
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Upload complete: 2 added, 1 already present, 0 invalid",

[Killed] BlockStatement
main/pages/Admin/InstructorsIndexPage.tsx:39:30
     uploadMutation.mutate(data);
   };
 
-  const createButton = () => {
-    return (
-      <Link
-        className="btn btn-primary"
-        to="/admin/instructors/create"
-        style={{ float: "right" }}
-      >
-        New Instructor
-      </Link>
-    );
-  };
+  const createButton = () => {};
 
   return (
killedBy: InstructorsIndexPage tests Renders with New Instructor Button
statusReason: Unable to find an element with the text: /New Instructor/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ObjectLiteral
main/pages/Admin/InstructorsIndexPage.tsx:44:16
       <Link
         className="btn btn-primary"
         to="/admin/instructors/create"
-        style={{ float: "right" }}
+        style={{}}
       >
         New Instructor
killedBy: InstructorsIndexPage tests Renders with New Instructor Button
statusReason: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null

[Killed] LogicalOperator
main/pages/Admin/InstructorsIndexPage.tsx:57:17
         {createButton()}
         <h1>Instructors</h1>
         <RoleEmailTable
-          data={instructors ?? []}
+          data={instructors && []}
           deleteEndpoint="/api/admin/instructors/delete"
           getEndpoint="/api/admin/instructors/get"
killedBy: InstructorsIndexPage tests renders three items correctly
statusReason: Unable to find an element by: [data-testid="InstructorsIndexPage-cell-row-0-col-email"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[NoCoverage] ArrayDeclaration
main/pages/Admin/InstructorsIndexPage.tsx:57:32
         {createButton()}
         <h1>Instructors</h1>
         <RoleEmailTable
-          data={instructors ?? []}
+          data={instructors ?? ["Stryker was here"]}
           deleteEndpoint="/api/admin/instructors/delete"
           getEndpoint="/api/admin/instructors/get"
