[Killed] ArrowFunction
main/components/Common/OurTable.tsx:21:17
 /** Optional per-column presentation, passed through a column's `meta` key. */
 type ColumnStyleMeta = { style?: CSSProperties };
 
-const styleOf = (meta: unknown): CSSProperties | undefined =>
-  (meta as ColumnStyleMeta | undefined)?.style;
+const styleOf = () => undefined;
 
 type OurTableProps<T extends object> = {
killedBy: CourseTable tests the course number column shrinks to its content and Title takes the slack
statusReason: expect(element).toHaveStyle()

- Expected

- whiteSpace: nowrap;
- width: 1%;

[Killed] OptionalChaining
main/components/Common/OurTable.tsx:22:3
 type ColumnStyleMeta = { style?: CSSProperties };
 
 const styleOf = (meta: unknown): CSSProperties | undefined =>
-  (meta as ColumnStyleMeta | undefined)?.style;
+  (meta as ColumnStyleMeta | undefined).style;
 
 type OurTableProps<T extends object> = {
killedBy: JobsTable tests renders without crashing for empty table
statusReason: Cannot read properties of undefined (reading 'style')

[Killed] BooleanLiteral
main/components/Common/OurTable.tsx:35:19
   data,
   columns,
   testid = "testid",
-  enableSorting = true,
+  enableSorting = false,
 }: OurTableProps<T>): React.JSX.Element {
   const newColumns = convertOldStyleColumnsToNewStyle(columns);
killedBy: OurTable tests OurTable component tests placeholder headers work properly
statusReason: expect(element).toHaveAttribute("style", "cursor: pointer;") // element.getAttribute("style") === "cursor: pointer;"

Expected the element to have attribute:
  style="cursor: pointer;"
Received:
  null

[Killed] ArrowFunction
main/components/Common/OurTable.tsx:62:38
             // Stryker disable next-line StringLiteral : React key property not exposed in dom
             key={`${testid}-header-group-${i}`}
           >
-            {headerGroup.headers.map((header) => (
-              <th
-                data-testid={`${testid}-header-${header.column.id}`}
-                key={`${testid}-header-${header.column.id}`}
-                colSpan={header.colSpan}
-                style={styleOf(header.column.columnDef.meta)}
-              >
-                {header.isPlaceholder ? null : (
-                  <div
-                    // Add onClick handler for sorting if the column is sortable
-                    {...(header.column.getCanSort() && {
-                      onClick: header.column.getToggleSortingHandler(),
-                      style: { cursor: "pointer" }, // Add cursor style for visual cue
-                    })}
-                    data-testid={`${testid}-header-${header.column.id}-sort-header`}
-                  >
-                    {flexRender(
-                      header.column.columnDef.header,
-                      header.getContext(),
-                    )}
-                    <SortCaret header={header} testId={testid} />
-                  </div>
-                )}
-              </th>
-            ))}
+            {headerGroup.headers.map(() => undefined)}
           </tr>
         ))}
killedBy: JobsTable tests renders correctly with jobs data
statusReason: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="JobsTable"

[Killed] BlockStatement
main/components/Common/OurTable.tsx:91:48
         ))}
       </thead>
       <tbody>
-        {table.getRowModel().rows.map((row) => {
-          const rowTestId = `${testid}-row-${row.index}`;
-          return (
-            <tr
-              data-testid={rowTestId}
-              // Stryker disable next-line StringLiteral : React key property not exposed in dom
-              key={rowTestId}
-            >
-              {row.getVisibleCells().map((cell) => {
-                const testId = `${testid}-cell-row-${cell.row.index}-col-${cell.column.id}`;
-                return (
-                  <td
-                    data-testid={testId}
-                    // Stryker disable next-line StringLiteral : React key property not exposed in dom
-                    key={testId}
-                    style={styleOf(cell.column.columnDef.meta)}
-                  >
-                    {flexRender(cell.column.columnDef.cell, cell.getContext())}
-                  </td>
-                );
-              })}
-            </tr>
-          );
-        })}
+        {table.getRowModel().rows.map((row) => {})}
       </tbody>
     </table>
killedBy: CoursesIndexPage tests renders the heading, the configured subject area, and the courses
statusReason: Unable to find an element by: [data-testid="CoursesIndexPage-cell-row-0-col-courseId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] BlockStatement
main/components/Common/OurTable.tsx:99:52
               // Stryker disable next-line StringLiteral : React key property not exposed in dom
               key={rowTestId}
             >
-              {row.getVisibleCells().map((cell) => {
-                const testId = `${testid}-cell-row-${cell.row.index}-col-${cell.column.id}`;
-                return (
-                  <td
-                    data-testid={testId}
-                    // Stryker disable next-line StringLiteral : React key property not exposed in dom
-                    key={testId}
-                    style={styleOf(cell.column.columnDef.meta)}
-                  >
-                    {flexRender(cell.column.columnDef.cell, cell.getContext())}
-                  </td>
-                );
-              })}
+              {row.getVisibleCells().map((cell) => {})}
             </tr>
           );
killedBy: JobsTable tests renders correctly with jobs data
statusReason: Unable to find an element with the text: 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="JobsTable"
