[Killed] BlockStatement
main/pages/Auth/UnauthorizedPage.tsx:8:63
  * roles (see SecurityConfig's failureUrl and RoleAssignmentService.grantsAccess). No session was
  * ever established for them, so there is nothing to log out of.
  */
-export default function UnauthorizedPage(): React.JSX.Element {
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1 data-testid="UnauthorizedPage-message">
-          You are not authorized to access this application
-        </h1>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function UnauthorizedPage(): React.JSX.Element {}
 
killedBy: UnauthorizedPage tests shows the not-authorized message
statusReason: Unable to find an element by: [data-testid="UnauthorizedPage-message"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
