[Killed] EqualityOperator
main/components/Courses/CourseDeleteModal.tsx:22:13
 }: CourseDeleteModalProps): React.JSX.Element {
   return (
     <Modal
-      show={courseId !== null}
+      show={courseId === null}
       onHide={onCancel}
       centered={true}
killedBy: CourseTable tests clicking Delete opens a confirmation modal naming the course, and deletes nothing yet
statusReason: Unable to find an element by: [data-testid="CourseDeleteModal"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ConditionalExpression
main/components/Courses/CourseDeleteModal.tsx:22:13
 }: CourseDeleteModalProps): React.JSX.Element {
   return (
     <Modal
-      show={courseId !== null}
+      show={true}
       onHide={onCancel}
       centered={true}
killedBy: CourseTable tests cancelling the modal deletes nothing and closes it
statusReason: expected <button type="button" …(2)></button> to be null

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Survived] BooleanLiteral
main/components/Courses/CourseDeleteModal.tsx:24:17
     <Modal
       show={courseId !== null}
       onHide={onCancel}
-      centered={true}
+      centered={false}
       data-testid="CourseDeleteModal"
     >
