[Killed] ArrayDeclaration
src/main/utils/systemInfo.ts:19:15
 
 export function useSystemInfo() {
   return useQuery<SystemInfo>({
-    queryKey: ["systemInfo"],
+    queryKey: [],
     queryFn: async () => {
       try {
killedBy: SignInPage tests clicking Log In with Google navigates to the systemInfo oauthLogin url
statusReason: expected '/oauth2/authorization/google' to be '/oauth2/authorization/google-test' // Object.is equality
