[Killed] ArrowFunction
main/components/Courses/CourseTable.tsx:27:31
 }: CourseTableProps): React.JSX.Element {
   // Both flags go in one idempotent call, so a click saves immediately without needing a
   // separate endpoint per flag or any unsaved state to manage.
-  const objectToAxiosParams = (course: Course): AxiosRequestConfig => ({
-    url: "/api/courses/flags",
-    method: "PUT",
-    params: {
-      courseId: course.courseId,
-      needsTa: course.needsTa,
-      needsUla: course.needsUla,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const mutation = useBackendMutation<Course, Course>(objectToAxiosParams, {}, [
killedBy: CourseTable tests ticking the TA box PUTs both flags, flipping only TA
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] ArrowFunction
main/components/Courses/CourseTable.tsx:45:5
   const [pendingDelete, setPendingDelete] = useState<string | null>(null);
 
   const deleteMutation = useBackendMutation<string, unknown>(
-    (courseId) => ({
-      url: "/api/courses/delete",
-      method: "DELETE",
-      params: { courseId },
-    }),
+    () => undefined,
     { onSuccess: () => setPendingDelete(null) },
     ["/api/courses/all"],
killedBy: CourseTable tests confirming the modal deletes that course
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ObjectLiteral
main/components/Courses/CourseTable.tsx:48:15
     (courseId) => ({
       url: "/api/courses/delete",
       method: "DELETE",
-      params: { courseId },
+      params: {},
     }),
     { onSuccess: () => setPendingDelete(null) },
killedBy: CourseTable tests confirming the modal deletes that course
statusReason: expected {} to deeply equal { courseId: 'CMPSC   156' }

[Survived] ArrowFunction
main/components/Courses/CourseTable.tsx:50:18
       method: "DELETE",
       params: { courseId },
     }),
-    { onSuccess: () => setPendingDelete(null) },
+    { onSuccess: () => undefined },
     ["/api/courses/all"],
   );

[Killed] BlockStatement
main/components/Courses/CourseTable.tsx:54:69
     ["/api/courses/all"],
   );
 
-  const toggle = (course: Course, field: "needsTa" | "needsUla") => {
-    mutation.mutate({ ...course, [field]: !course[field] });
-  };
+  const toggle = (course: Course, field: "needsTa" | "needsUla") => {};
 
   const flagColumn = (
killedBy: CourseTable tests ticking the TA box PUTs both flags, flipping only TA
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] BooleanLiteral
main/components/Courses/CourseTable.tsx:55:43
   );
 
   const toggle = (course: Course, field: "needsTa" | "needsUla") => {
-    mutation.mutate({ ...course, [field]: !course[field] });
+    mutation.mutate({ ...course, [field]: course[field] });
   };
 
killedBy: CourseTable tests ticking the TA box PUTs both flags, flipping only TA
statusReason: expected { courseId: 'CMPSC   130A', …(2) } to deeply equal { courseId: 'CMPSC   130A', …(2) }

[Killed] ObjectLiteral
main/components/Courses/CourseTable.tsx:55:21
   );
 
   const toggle = (course: Course, field: "needsTa" | "needsUla") => {
-    mutation.mutate({ ...course, [field]: !course[field] });
+    mutation.mutate({});
   };
 
killedBy: CourseTable tests ticking the TA box PUTs both flags, flipping only TA
statusReason: expected { courseId: undefined, …(2) } to deeply equal { courseId: 'CMPSC   130A', …(2) }

[Killed] ArrowFunction
main/components/Courses/CourseTable.tsx:58:22
     mutation.mutate({ ...course, [field]: !course[field] });
   };
 
-  const flagColumn = (
-    header: string,
-    field: "needsTa" | "needsUla",
-    shortName: string,
-  ) => ({
-    header,
-    id: field,
-    accessorKey: field,
-    meta: { style: { width: "1%", whiteSpace: "nowrap" as const } },
-    cell: ({ cell }: { cell: Cell<Course, unknown> }) => {
-      const course = cell.row.original;
-      return (
-        <Form.Check
-          type="checkbox"
-          checked={course[field]}
-          onChange={() => toggle(course, field)}
-          aria-label={`${shortName} for ${course.courseId}`}
-          data-testid={`${testIdPrefix}-cell-row-${cell.row.index}-col-${field}-checkbox`}
-        />
-      );
-    },
-  });
+  const flagColumn = () => undefined;
 
   // Widths: everything shrinks to its content except Title, which is given 100% so it absorbs
killedBy: CoursesIndexPage tests renders the heading, the configured subject area, and the courses
statusReason: Cannot read properties of undefined (reading 'accessor')

[Killed] BlockStatement
main/components/Courses/CourseTable.tsx:67:58
     id: field,
     accessorKey: field,
     meta: { style: { width: "1%", whiteSpace: "nowrap" as const } },
-    cell: ({ cell }: { cell: Cell<Course, unknown> }) => {
-      const course = cell.row.original;
-      return (
-        <Form.Check
-          type="checkbox"
-          checked={course[field]}
-          onChange={() => toggle(course, field)}
-          aria-label={`${shortName} for ${course.courseId}`}
-          data-testid={`${testIdPrefix}-cell-row-${cell.row.index}-col-${field}-checkbox`}
-        />
-      );
-    },
+    cell: ({ cell }: { cell: Cell<Course, unknown> }) => {},
   });
 
killedBy: CourseTable tests checkboxes reflect the current flags
statusReason: Unable to find an element by: [data-testid="CourseTable-cell-row-0-col-needsTa-checkbox"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CourseTable"

[Killed] ArrowFunction
main/components/Courses/CourseTable.tsx:73:21
         <Form.Check
           type="checkbox"
           checked={course[field]}
-          onChange={() => toggle(course, field)}
+          onChange={() => undefined}
           aria-label={`${shortName} for ${course.courseId}`}
           data-testid={`${testIdPrefix}-cell-row-${cell.row.index}-col-${field}-checkbox`}
killedBy: CourseTable tests ticking the TA box PUTs both flags, flipping only TA
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Survived] StringLiteral
main/components/Courses/CourseTable.tsx:88:33
   };
 
   const columns = [
-    flagColumn("TA", "needsTa", "TA"),
+    flagColumn("TA", "needsTa", ""),
     flagColumn("ULA", "needsUla", "ULA"),
     {

[Killed] StringLiteral
main/components/Courses/CourseTable.tsx:89:23
 
   const columns = [
     flagColumn("TA", "needsTa", "TA"),
-    flagColumn("ULA", "needsUla", "ULA"),
+    flagColumn("ULA", "", "ULA"),
     {
       header: "Course Number",
killedBy: CourseTable tests renders the expected headers and rows
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Courses/CourseTable.tsx:92:20
     flagColumn("ULA", "needsUla", "ULA"),
     {
       header: "Course Number",
-      accessorKey: "courseId",
+      accessorKey: "",
       meta: shrinkToContent,
       // Course ids keep the API's fixed-width padding so they sort numerically. HTML collapses
killedBy: CourseTable tests renders the expected headers and rows
statusReason: Columns require an id when using a non-string header

[Killed] ArrowFunction
main/components/Courses/CourseTable.tsx:98:13
       // runs of spaces by default, so render them preformatted and monospaced to keep the
       // numbers aligned. The field is at most 13 characters: an 8-character subject code, then a
       // course number of up to 3 digits and 2 letters.
-      cell: ({ cell }: { cell: Cell<Course, unknown> }) => (
-        <span style={{ whiteSpace: "pre", fontFamily: "monospace" }}>
-          {cell.row.original.courseId}
-        </span>
-      ),
+      cell: () => undefined,
     },
     {
killedBy: CourseTable tests renders the expected headers and rows
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  CMPSC   130A
Received:

[Killed] StringLiteral
main/components/Courses/CourseTable.tsx:99:55
       // numbers aligned. The field is at most 13 characters: an 8-character subject code, then a
       // course number of up to 3 digits and 2 letters.
       cell: ({ cell }: { cell: Cell<Course, unknown> }) => (
-        <span style={{ whiteSpace: "pre", fontFamily: "monospace" }}>
+        <span style={{ whiteSpace: "pre", fontFamily: "" }}>
           {cell.row.original.courseId}
         </span>
killedBy: CourseTable tests the course number keeps its padding visible
statusReason: expect(element).toHaveStyle()

- Expected

- fontFamily: monospace;
- whiteSpace: pre;

[Killed] ObjectLiteral
main/components/Courses/CourseTable.tsx:104:5
         </span>
       ),
     },
-    {
-      header: "Title",
-      accessorKey: "title",
-      meta: { style: { width: "100%" } },
-    },
+    {},
     {
       header: "Delete",
killedBy: CoursesIndexPage tests renders the heading, the configured subject area, and the courses
statusReason: Columns require an id when using a non-string header

[Killed] ObjectLiteral
main/components/Courses/CourseTable.tsx:107:13
     {
       header: "Title",
       accessorKey: "title",
-      meta: { style: { width: "100%" } },
+      meta: {},
     },
     {
killedBy: CourseTable tests the course number column shrinks to its content and Title takes the slack
statusReason: expect(element).toHaveStyle()

- Expected

- width: 100%;

[Killed] ObjectLiteral
main/components/Courses/CourseTable.tsx:109:5
       accessorKey: "title",
       meta: { style: { width: "100%" } },
     },
-    {
-      header: "Delete",
-      id: "delete",
-      accessorKey: "courseId",
-      meta: shrinkToContent,
-      cell: ({ cell }: { cell: Cell<Course, unknown> }) => (
-        <Button
-          variant="danger"
-          onClick={() => setPendingDelete(cell.row.original.courseId)}
-          data-testid={`${testIdPrefix}-cell-row-${cell.row.index}-col-delete-button`}
-        >
-          Delete
-        </Button>
-      ),
-    },
+    {},
   ];
 
killedBy: CourseTable tests renders the expected headers and rows
statusReason: Columns require an id when using a non-string header

[Killed] ArrowFunction
main/components/Courses/CourseTable.tsx:114:13
       id: "delete",
       accessorKey: "courseId",
       meta: shrinkToContent,
-      cell: ({ cell }: { cell: Cell<Course, unknown> }) => (
-        <Button
-          variant="danger"
-          onClick={() => setPendingDelete(cell.row.original.courseId)}
-          data-testid={`${testIdPrefix}-cell-row-${cell.row.index}-col-delete-button`}
-        >
-          Delete
-        </Button>
-      ),
+      cell: () => undefined,
     },
   ];
killedBy: CourseTable tests clicking Delete opens a confirmation modal naming the course, and deletes nothing yet
statusReason: Unable to find an element by: [data-testid="CourseTable-cell-row-0-col-delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CourseTable"

[Killed] ArrowFunction
main/components/Courses/CourseTable.tsx:117:20
       cell: ({ cell }: { cell: Cell<Course, unknown> }) => (
         <Button
           variant="danger"
-          onClick={() => setPendingDelete(cell.row.original.courseId)}
+          onClick={() => undefined}
           data-testid={`${testIdPrefix}-cell-row-${cell.row.index}-col-delete-button`}
         >
killedBy: CourseTable tests clicking Delete opens a confirmation modal naming the course, and deletes nothing yet
statusReason: Unable to find an element by: [data-testid="CourseDeleteModal"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CourseTable"

[Killed] StringLiteral
main/components/Courses/CourseTable.tsx:118:24
         <Button
           variant="danger"
           onClick={() => setPendingDelete(cell.row.original.courseId)}
-          data-testid={`${testIdPrefix}-cell-row-${cell.row.index}-col-delete-button`}
+          data-testid={``}
         >
           Delete
killedBy: CourseTable tests clicking Delete opens a confirmation modal naming the course, and deletes nothing yet
statusReason: Unable to find an element by: [data-testid="CourseTable-cell-row-0-col-delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CourseTable"

[Killed] ArrayDeclaration
main/components/Courses/CourseTable.tsx:129:50
   return (
     <>
       <OurTable
-        data={Array.isArray(courses) ? courses : []}
+        data={Array.isArray(courses) ? courses : ["Stryker was here"]}
         columns={columns}
         testid={testIdPrefix}
killedBy: CourseTable tests tolerates a non-array courses prop
statusReason: expected <td …(2)><span …(1)></span></td> to be null

[Killed] ArrowFunction
main/components/Courses/CourseTable.tsx:135:20
       />
       <CourseDeleteModal
         courseId={pendingDelete}
-        onConfirm={() => deleteMutation.mutate(pendingDelete as string)}
+        onConfirm={() => undefined}
         onCancel={() => setPendingDelete(null)}
       />
killedBy: CourseTable tests confirming the modal deletes that course
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ArrowFunction
main/components/Courses/CourseTable.tsx:136:19
       <CourseDeleteModal
         courseId={pendingDelete}
         onConfirm={() => deleteMutation.mutate(pendingDelete as string)}
-        onCancel={() => setPendingDelete(null)}
+        onCancel={() => undefined}
       />
     </>
killedBy: CourseTable tests cancelling the modal deletes nothing and closes it
statusReason: expected <button type="button" …(2)></button> to be null

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""
