[Killed] ConditionalExpression
main/components/Quarters/SingleQuarterDropdown.jsx:34:7
 
   // quarterRange returns [] if the configured start quarter is after the end quarter, and this
   // used to throw on quarters[lastInd] and take the whole page down with it.
-  if (!localSearchQuarter && quarters.length > 0) {
+  if (true) {
     localStorage.setItem(controlId, quarters[lastInd].yyyyq);
   }
killedBy: SingleQuarterSelector tests does not crash when the quarter range is empty
statusReason: Cannot read properties of undefined (reading 'yyyyq')

[Killed] ConditionalExpression
main/components/Quarters/SingleQuarterDropdown.jsx:34:30
 
   // quarterRange returns [] if the configured start quarter is after the end quarter, and this
   // used to throw on quarters[lastInd] and take the whole page down with it.
-  if (!localSearchQuarter && quarters.length > 0) {
+  if (!localSearchQuarter && true) {
     localStorage.setItem(controlId, quarters[lastInd].yyyyq);
   }
killedBy: SingleQuarterSelector tests does not crash when the quarter range is empty
statusReason: Cannot read properties of undefined (reading 'yyyyq')
