[Killed] StringLiteral
main/components/Users/RoleEmailCsvUploadForm.tsx:33:19
   // Stryker restore all
 
   // Unique per instance, so two of these forms could coexist on one page.
-  const inputId = `${testIdPrefix}-upload-input`;
+  const inputId = ``;
 
   return (
killedBy: RoleEmailCsvUploadForm tests the label is wired to the input, with an id unique to the instance
statusReason: Found a label with the text of: Upload Instructor Emails (CSV), however no form control was found associated to that label. Make sure you're using the "for" attribute or "aria-labelledby" attribute correctly.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BooleanLiteral
main/components/Users/RoleEmailCsvUploadForm.tsx:45:46
           type="file"
           accept=".csv"
           isInvalid={Boolean(errors.upload)}
-          {...register("upload", { required: true })}
+          {...register("upload", { required: false })}
         />
         <Form.Control.Feedback type="invalid">
killedBy: RoleEmailCsvUploadForm tests shows a validation error and does not submit when no file is chosen
statusReason: Unable to find an element with the text: /A CSV file is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/Users/RoleEmailCsvUploadForm.tsx:45:34
           type="file"
           accept=".csv"
           isInvalid={Boolean(errors.upload)}
-          {...register("upload", { required: true })}
+          {...register("upload", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: RoleEmailCsvUploadForm tests shows a validation error and does not submit when no file is chosen
statusReason: Unable to find an element with the text: /A CSV file is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/Users/RoleEmailCsvUploadForm.tsx:48:12
           {...register("upload", { required: true })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.upload && "A CSV file is required. "}
+          {true}
         </Form.Control.Feedback>
         <Form.Text muted>
killedBy: RoleEmailCsvUploadForm tests shows a validation error and does not submit when no file is chosen
statusReason: Unable to find an element with the text: /A CSV file is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/Users/RoleEmailCsvUploadForm.tsx:48:12
           {...register("upload", { required: true })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.upload && "A CSV file is required. "}
+          {false}
         </Form.Control.Feedback>
         <Form.Text muted>
killedBy: RoleEmailCsvUploadForm tests shows a validation error and does not submit when no file is chosen
statusReason: Unable to find an element with the text: /A CSV file is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
