[Killed] ObjectLiteral
main/components/Users/RoleEmailTable.tsx:58:5
   const deleteCallback = customDeleteCallback || defaultDeleteCallback;
 
   const columns = [
-    {
-      header: "Email",
-      accessorKey: "email", // accessor is the "key" in the data
-      // Takes the slack from Bootstrap's full-width table, so Delete shrinks to its button
-      // instead of the two columns splitting the width evenly.
-      meta: { style: { width: "100%" } },
-    },
+    {},
     {
       header: "Delete",
killedBy: RoleEmailTable renders empty table correctly when data is null
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Users/RoleEmailTable.tsx:68:31
     {
       header: "Delete",
       accessorKey: "isInAdminEmails",
-      meta: { style: { width: "1%", whiteSpace: "nowrap" as const } },
+      meta: { style: { width: "", whiteSpace: "nowrap" as const } },
       cell: ({ cell }: { cell: Cell<RoleEmail, unknown> }) => {
         if (!cell.row.original.isInAdminEmails) {
killedBy: RoleEmailTable the Delete column shrinks to its button and Email takes the slack
statusReason: expect(element).toHaveStyle()

- Expected

- whiteSpace: nowrap;
- width: 1%;

[Killed] BlockStatement
main/components/Users/RoleEmailTable.tsx:69:63
       header: "Delete",
       accessorKey: "isInAdminEmails",
       meta: { style: { width: "1%", whiteSpace: "nowrap" as const } },
-      cell: ({ cell }: { cell: Cell<RoleEmail, unknown> }) => {
-        if (!cell.row.original.isInAdminEmails) {
-          return (
-            <Button
-              className="btn btn-danger"
-              onClick={() => deleteCallback(cell)}
-              data-testid={`${testIdPrefix}-cell-row-${cell.row.index}-col-delete-button`}
-            >
-              Delete
-            </Button>
-          );
-        }
-        return (
-          <span
-            data-testid={`${testIdPrefix}-cell-row-${cell.row.index}-cannot-delete`}
-          >
-            In <code>ADMIN_EMAILS</code>
-          </span>
-        );
-      },
+      cell: ({ cell }: { cell: Cell<RoleEmail, unknown> }) => {},
     },
   ];
killedBy: GradStudentsIndexPage tests renders three items correctly
statusReason: Unable to find an element by: [data-testid="GradStudentsIndexPage-cell-row-0-col-delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] BlockStatement
main/components/Users/RoleEmailTable.tsx:70:49
       accessorKey: "isInAdminEmails",
       meta: { style: { width: "1%", whiteSpace: "nowrap" as const } },
       cell: ({ cell }: { cell: Cell<RoleEmail, unknown> }) => {
-        if (!cell.row.original.isInAdminEmails) {
-          return (
-            <Button
-              className="btn btn-danger"
-              onClick={() => deleteCallback(cell)}
-              data-testid={`${testIdPrefix}-cell-row-${cell.row.index}-col-delete-button`}
-            >
-              Delete
-            </Button>
-          );
-        }
+        if (!cell.row.original.isInAdminEmails) {}
         return (
           <span
killedBy: GradStudentsIndexPage tests renders three items correctly
statusReason: Unable to find an element by: [data-testid="GradStudentsIndexPage-cell-row-0-col-delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"
