[Killed] ObjectLiteral
main/components/Users/UsersTable.tsx:16:3
 };
 
 const columns: LegacyColumn[] = [
-  {
-    Header: "id",
-    accessor: "id", // accessor is the "key" in the data
-  },
+  {},
   {
     header: "First Name",
killedBy: AdminUsersPage tests renders paged users with controls
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Users/UsersTable.tsx:22:18
   },
   {
     header: "First Name",
-    accessorKey: "givenName",
+    accessorKey: "",
   },
   {
killedBy: UserTable tests renders without crashing for empty table
statusReason: Columns require an id when using a non-string header

[Killed] BlockStatement
main/components/Users/UsersTable.tsx:44:56
     header: "Instructor",
     id: "instructor",
     accessorKey: "instructor",
-    cell: ({ cell }: { cell: Cell<User, unknown> }) => {
-      return String(cell.getValue());
-    }, // convert boolean to string for display
+    cell: ({ cell }: { cell: Cell<User, unknown> }) => {}, // convert boolean to string for display
   },
   {
killedBy: AdminUsersPage tests renders paged users with controls
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  true
Received:

[Killed] BlockStatement
main/components/Users/UsersTable.tsx:52:56
     header: "Grad Student",
     id: "gradStudent",
     accessorKey: "gradStudent",
-    cell: ({ cell }: { cell: Cell<User, unknown> }) => {
-      return String(cell.getValue());
-    }, // convert boolean to string for display
+    cell: ({ cell }: { cell: Cell<User, unknown> }) => {}, // convert boolean to string for display
   },
 ];
killedBy: UserTable tests Has the expected colum headers and content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  true
Received:

[Killed] StringLiteral
main/components/Users/UsersTable.tsx:65:59
 export default function UsersTable({
   users,
 }: UsersTableProps): React.JSX.Element {
-  return <OurTable data={users} columns={columns} testid={"UsersTable"} />;
+  return <OurTable data={users} columns={columns} testid={""} />;
 }
 
killedBy: AdminUsersPage tests renders paged users with controls
statusReason: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-email"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"
