[Killed] BlockStatement
src/main/utils/csvUpload.ts:15:23
 export function csvUploadAxiosParams(
   url: string,
   file: File,
-): AxiosRequestConfig {
-  const formData = new FormData();
-  formData.append("file", file);
-  return {
-    url,
-    method: "POST",
-    data: formData,
-    headers: { "Content-Type": "multipart/form-data" },
-  };
-}
+): AxiosRequestConfig {}
 
 /**
killedBy: InstructorsIndexPage tests uploading a CSV posts it and toasts the summary
statusReason: expected [] to have a length of 1 but got +0

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
src/main/utils/csvUpload.ts:18:10
 ): AxiosRequestConfig {
   const formData = new FormData();
   formData.append("file", file);
-  return {
-    url,
-    method: "POST",
-    data: formData,
-    headers: { "Content-Type": "multipart/form-data" },
-  };
+  return {};
 }
 
killedBy: InstructorsIndexPage tests uploading a CSV posts it and toasts the summary
statusReason: expected [] to have a length of 1 but got +0

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
src/main/utils/csvUpload.ts:30:67
  * The toast an admin sees after an upload. Shared so the grad students and instructors pages
  * report results in the same words.
  */
-export function uploadResultMessage(result: UploadResult): string {
-  let message = `Upload complete: ${result.inserted} added, ${result.alreadyPresent} already present, ${result.invalid} invalid`;
-  if (result.invalidEmails?.length > 0) {
-    message += ` (${result.invalidEmails.join(", ")})`;
-  }
-  return message;
-}
+export function uploadResultMessage(result: UploadResult): string {}
 
killedBy: GradStudentsIndexPage tests uploading a CSV posts it and toasts the summary
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Upload complete: 2 added, 1 already present, 0 invalid",

[Killed] BlockStatement
src/main/utils/csvUpload.ts:32:41
  */
 export function uploadResultMessage(result: UploadResult): string {
   let message = `Upload complete: ${result.inserted} added, ${result.alreadyPresent} already present, ${result.invalid} invalid`;
-  if (result.invalidEmails?.length > 0) {
-    message += ` (${result.invalidEmails.join(", ")})`;
-  }
+  if (result.invalidEmails?.length > 0) {}
   return message;
 }
killedBy: GradStudentsIndexPage tests invalid emails from the upload are listed in the toast
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Upload complete: 1 added, 0 already present, 2 invalid (nope, also-nope)",

[Killed] ConditionalExpression
src/main/utils/csvUpload.ts:32:7
  */
 export function uploadResultMessage(result: UploadResult): string {
   let message = `Upload complete: ${result.inserted} added, ${result.alreadyPresent} already present, ${result.invalid} invalid`;
-  if (result.invalidEmails?.length > 0) {
+  if (false) {
     message += ` (${result.invalidEmails.join(", ")})`;
   }
killedBy: InstructorsIndexPage tests invalid emails from the upload are listed in the toast
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Upload complete: 1 added, 0 already present, 2 invalid (nope, also-nope)",
