[Killed] BlockStatement
src/main/utils/useBackend.ts:73:3
   // unknown[] rather than string[], to match useBackend: a key may carry non-string parts, such
   // as a page number or a boolean toggle, and both sides must be able to express the same key.
   queryKey: unknown[] | null = null,
-) {
-  const queryClient = useQueryClient();
-
-  return useMutation({
-    mutationFn: (object: TInput) =>
-      wrappedParams<TData>(objectToAxiosParams(object)),
-    onError: (data) => {
-      toast(`${data}`);
-    },
-    // Stryker disable all: Not sure how to set up the complex behavior needed to test this
-    onSettled: () => {
-      if (queryKey !== null) {
-        // Handle array of query keys for cache invalidation
-        if (Array.isArray(queryKey)) {
-          queryKey.forEach((key) => {
-            queryClient.invalidateQueries({ queryKey: [key] });
-          });
-        }
-      }
-    },
-    // Stryker restore all
-    retry: false,
-    ...useMutationParams,
-  });
-}
+) {}
 
killedBy: utils/useBackend tests utils/useBackend useBackendMutation tests useBackendMutation handles success correctly
statusReason: Cannot read properties of undefined (reading 'mutate')
