[Killed] EqualityOperator
main/components/Recruitments/RecruitmentDeleteModal.tsx:21:13
 }: RecruitmentDeleteModalProps): React.JSX.Element {
   return (
     <Modal
-      show={recruitment !== null}
+      show={recruitment === null}
       onHide={onCancel}
       centered={true}
killedBy: RecruitmentsIndexPage tests creating a recruitment posts the form and toasts
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ConditionalExpression
main/components/Recruitments/RecruitmentDeleteModal.tsx:21:13
 }: RecruitmentDeleteModalProps): React.JSX.Element {
   return (
     <Modal
-      show={recruitment !== null}
+      show={false}
       onHide={onCancel}
       centered={true}
killedBy: RecruitmentsIndexPage tests Delete asks for confirmation and deletes nothing yet
statusReason: Unable to find an element by: [data-testid="RecruitmentDeleteModal"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] OptionalChaining
main/components/Recruitments/RecruitmentDeleteModal.tsx:29:48
       <Modal.Header closeButton>Delete Recruitment</Modal.Header>
       <Modal.Body>
         <p data-testid="RecruitmentDeleteModal-body">
-          Are you sure you want to delete the {recruitment?.type} recruitment
+          Are you sure you want to delete the {recruitment.type} recruitment
           for {recruitment ? yyyyqToQyy(recruitment.quarter) : ""}?
         </p>
killedBy: RecruitmentsIndexPage tests renders the heading and the recruitments
statusReason: Cannot read properties of null (reading 'type')
