[Killed] LogicalOperator
main/components/Recruitments/RecruitmentForm.tsx:33:42
   // Stryker restore all
 
   // The quarter dropdown keeps its own state, so mirror it here for submission.
-  const [quarter, setQuarter] = useState(quarters[0]?.yyyyq ?? "");
+  const [quarter, setQuarter] = useState(quarters[0]?.yyyyq && "");
 
   const testIdPrefix = "RecruitmentForm";
killedBy: RecruitmentsIndexPage tests creating a recruitment posts the form and toasts
statusReason: expected { type: 'ULA', …(3) } to deeply equal { quarter: '20211', type: 'ULA', …(2) }

[Killed] OptionalChaining
main/components/Recruitments/RecruitmentForm.tsx:33:42
   // Stryker restore all
 
   // The quarter dropdown keeps its own state, so mirror it here for submission.
-  const [quarter, setQuarter] = useState(quarters[0]?.yyyyq ?? "");
+  const [quarter, setQuarter] = useState(quarters[0].yyyyq ?? "");
 
   const testIdPrefix = "RecruitmentForm";
killedBy: RecruitmentForm tests renders without a quarter when the range is empty
statusReason: Cannot read properties of undefined (reading 'yyyyq')

[Killed] ArrowFunction
main/components/Recruitments/RecruitmentForm.tsx:38:34
   const testIdPrefix = "RecruitmentForm";
 
   return (
-    <Form onSubmit={handleSubmit((data) => submitAction({ ...data, quarter }))}>
+    <Form onSubmit={handleSubmit(() => undefined)}>
       <div className="d-flex gap-3 align-items-start flex-wrap">
         <SingleQuarterDropdown
killedBy: RecruitmentsIndexPage tests creating a recruitment posts the form and toasts
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/components/Recruitments/RecruitmentForm.tsx:52:26
           <Form.Label htmlFor={`${testIdPrefix}-type`}>Type</Form.Label>
           <Form.Select
             id={`${testIdPrefix}-type`}
-            data-testid={`${testIdPrefix}-type`}
+            data-testid={``}
             {...register("type")}
           >
killedBy: RecruitmentForm tests renders the quarter, type and both date fields
statusReason: Unable to find an element by: [data-testid="RecruitmentForm-type"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Recruitments/RecruitmentForm.tsx:53:26
           <Form.Select
             id={`${testIdPrefix}-type`}
             data-testid={`${testIdPrefix}-type`}
-            {...register("type")}
+            {...register("")}
           >
             <option value="TA">TA</option>
killedBy: RecruitmentForm tests renders the quarter, type and both date fields
statusReason: Cannot read properties of undefined (reading '_f')

[Survived] StringLiteral
main/components/Recruitments/RecruitmentForm.tsx:65:17
             Tentative Opening Date
           </Form.Label>
           <Form.Control
-            id={`${testIdPrefix}-tentativeOpeningDate`}
+            id={``}
             data-testid={`${testIdPrefix}-tentativeOpeningDate`}
             type="date"

[Killed] BooleanLiteral
main/components/Recruitments/RecruitmentForm.tsx:69:62
             data-testid={`${testIdPrefix}-tentativeOpeningDate`}
             type="date"
             isInvalid={Boolean(errors.tentativeOpeningDate)}
-            {...register("tentativeOpeningDate", { required: true })}
+            {...register("tentativeOpeningDate", { required: false })}
           />
           <Form.Control.Feedback type="invalid">
killedBy: RecruitmentsIndexPage tests the form will not submit without the required dates
statusReason: Unable to find an element with the text: /A tentative opening date is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] LogicalOperator
main/components/Recruitments/RecruitmentForm.tsx:72:14
             {...register("tentativeOpeningDate", { required: true })}
           />
           <Form.Control.Feedback type="invalid">
-            {errors.tentativeOpeningDate &&
-              "A tentative opening date is required."}
+            {errors.tentativeOpeningDate || "A tentative opening date is required."}
           </Form.Control.Feedback>
         </Form.Group>
killedBy: RecruitmentsIndexPage tests the form will not submit without the required dates
statusReason: Unable to find an element with the text: /A tentative opening date is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
main/components/Recruitments/RecruitmentForm.tsx:72:14
             {...register("tentativeOpeningDate", { required: true })}
           />
           <Form.Control.Feedback type="invalid">
-            {errors.tentativeOpeningDate &&
-              "A tentative opening date is required."}
+            {false}
           </Form.Control.Feedback>
         </Form.Group>
killedBy: RecruitmentsIndexPage tests the form will not submit without the required dates
statusReason: Unable to find an element with the text: /A tentative opening date is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] BooleanLiteral
main/components/Recruitments/RecruitmentForm.tsx:86:66
             data-testid={`${testIdPrefix}-primaryConsiderationDate`}
             type="date"
             isInvalid={Boolean(errors.primaryConsiderationDate)}
-            {...register("primaryConsiderationDate", { required: true })}
+            {...register("primaryConsiderationDate", { required: false })}
           />
           <Form.Control.Feedback type="invalid">
killedBy: RecruitmentForm tests both dates are required
statusReason: Unable to find an element with the text: /A primary consideration date is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Recruitments/RecruitmentForm.tsx:86:26
             data-testid={`${testIdPrefix}-primaryConsiderationDate`}
             type="date"
             isInvalid={Boolean(errors.primaryConsiderationDate)}
-            {...register("primaryConsiderationDate", { required: true })}
+            {...register("", { required: true })}
           />
           <Form.Control.Feedback type="invalid">
killedBy: RecruitmentsIndexPage tests renders the heading and the recruitments
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] ConditionalExpression
main/components/Recruitments/RecruitmentForm.tsx:89:14
             {...register("primaryConsiderationDate", { required: true })}
           />
           <Form.Control.Feedback type="invalid">
-            {errors.primaryConsiderationDate &&
-              "A primary consideration date is required."}
+            {true}
           </Form.Control.Feedback>
         </Form.Group>
killedBy: RecruitmentForm tests both dates are required
statusReason: Unable to find an element with the text: /A primary consideration date is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/Recruitments/RecruitmentForm.tsx:89:14
             {...register("primaryConsiderationDate", { required: true })}
           />
           <Form.Control.Feedback type="invalid">
-            {errors.primaryConsiderationDate &&
-              "A primary consideration date is required."}
+            {errors.primaryConsiderationDate || "A primary consideration date is required."}
           </Form.Control.Feedback>
         </Form.Group>
killedBy: RecruitmentForm tests both dates are required
statusReason: Unable to find an element with the text: /A tentative opening date is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
